MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_i2c.c
  * @brief   I2C HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Inter Integrated Circuit (I2C) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(I2C1) || defined(I2C2)
#if defined(USE_HAL_I2C_MODULE) && (USE_HAL_I2C_MODULE == 1)

/** @addtogroup I2C I2C
  * @{
  */
/** @defgroup I2C_Introduction I2C Introduction
  * @{

  - The I2C hardware abstraction layer provides a set of APIs to interface with the STM32 I2C (Inter-integrated circuit
    interface) peripheral.

  - It simplifies the configuration, initialization and management of I2C communication, by supporting various modes
    such as polling, interrupt, and DMA for efficient data transfer.

  - This abstraction layer ensures portability and ease of use across different STM32 series.

  */
/**
  * @}
  */

/** @defgroup I2C_How_To_Use I2C How To Use
  * @{

# How to use the I2C HAL module driver

1. Declare a hal_i2c_handle_t handle structure and initialize the I2Cx driver
   with an I2C HW instance by calling the HAL_I2C_Init().
   The I2Cx clock is enabled inside the HAL_I2C_Init() if USE_HAL_I2C_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO.

2. Configure the low level hardware (GPIO, CLOCK, NVIC...etc):
  - Enable the I2Cx clock if USE_HAL_I2C_CLK_ENABLE_MODEL = HAL_CLK_ENABLE_NO
  - I2Cx pins configuration :
    - Enable the clock for the I2Cx GPIOs
      - Configure I2Cx pins as alternate function open-drain
    - NVIC configuration if you need to use interrupt process
      - Configure the I2Cx interrupt priority
      - Enable the NVIC I2Cx IRQ Channel
    - DMA configuration if you need to use DMA process
      - Declare a hal_dma_handle_t handle structure for the Transmit or Receive channel
      - Enable the DMAx clock
      - Configure the DMA transfer parameters for each direction, Transmit or Receive
      - Associate the initialized DMA handle to the hi2c DMA Tx or Rx handle respectively using HAL_I2C_SetTxDMA()
        or HAL_I2C_SetRxDMA()
      - For each DMA channel (Tx and Rx), configure the corresponding NVIC line priority and enable it

3. Configure the communication Clock Timing, Own Address1, Master Addressing mode by calling HAL_I2C_SetConfig().

4. Configure and/or enable advanced features. For instances, HAL_I2C_EnableAnalogFilter(), HAL_I2C_SetDigitalFilter(),
   HAL_I2C_SetConfigOwnAddress2(), HAL_I2C_EnableOwnAddress2(), etc.
   All these advanced configurations are optional (not mandatory).

5. For I2Cx IO and IO MEM operations, three operation modes, polling, interrupt and dma are available
   within this driver.
  - Polling mode IO operation
    - Transmit in master mode an amount of data in blocking mode using HAL_I2C_MASTER_Transmit()
    - Receive in master mode an amount of data in blocking mode using HAL_I2C_MASTER_Receive()
    - Transmit in slave mode an amount of data in blocking mode using HAL_I2C_SLAVE_Transmit()
    - Receive in slave mode an amount of data in blocking mode using HAL_I2C_SLAVE_Receive()

  - Polling mode IO MEM operation
    - Write an amount of data in blocking mode to a specific memory address using HAL_I2C_MASTER_MemWrite()
    - Read an amount of data in blocking mode from a specific memory address using HAL_I2C_MASTER_MemRead()

  - Interrupt mode IO operation
    - Transmit in master mode an amount of data in non-blocking mode using HAL_I2C_MASTER_Transmit_IT()
    - At transmission end of transfer, HAL_I2C_MASTER_TxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - Receive in master mode an amount of data in non-blocking mode using HAL_I2C_MASTER_Receive_IT()
    - At reception end of transfer, HAL_I2C_MASTER_RxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - Transmit in slave mode an amount of data in non-blocking mode using HAL_I2C_SLAVE_Transmit_IT()
    - At transmission end of transfer, HAL_I2C_SLAVE_TxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - Receive in slave mode an amount of data in non-blocking mode using HAL_I2C_SLAVE_Receive_IT()
    - At reception end of transfer, HAL_I2C_SLAVE_RxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - In case of transfer error, HAL_I2C_ErrorCallback() function is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - Abort a master or memory I2C process communication with interrupt using HAL_I2C_MASTER_Abort_IT()
    - End of abort process, HAL_I2C_AbortCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - Discard a slave I2C process communication using HAL_I2C_SLAVE_Abort_IT().
      This action informs master to generate a Stop condition to discard the communication.

  - Interrupt mode or DMA mode IO sequential operation
      These interfaces allow to manage a sequential transfer with a repeated start condition when a direction change
      during transfer. A specific option field manage the different steps of a sequential transfer through
      hal_i2c_xfer_opt_t and are listed below

    - HAL_I2C_XFER_FIRST_AND_LAST_FRAME: No sequential, functional is same as associated interfaces
      in no sequential mode.

