MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
    - HAL_I2C_XFER_FIRST_FRAME: Sequential, this option allows to manage a sequence with start condition, address and
      data to transfer without a final stop condition.

    - HAL_I2C_XFER_FIRST_AND_NEXT_FRAME: Sequential (master only), this option allows to manage a sequence with start
      condition, address and data to transfer without a final stop condition, an then permit a call the same master
      sequential interface several times (like HAL_I2C_MASTER_SEQ_Transmit_IT() then HAL_I2C_MASTER_SEQ_Transmit_IT()
      or HAL_I2C_MASTER_SEQ_Transmit_DMA() then HAL_I2C_MASTER_SEQ_Transmit_DMA())

    - HAL_I2C_XFER_NEXT_FRAME: Sequential, this option allows to manage a sequence with a restart condition, address
      and with new data to transfer if the direction change or manage only the new data to transfer if no direction
      change and without a final stop condition in both cases.

    - HAL_I2C_XFER_LAST_FRAME: Sequential, this option allows to manage a sequence with a restart condition, address
      and with new data to transfer if the direction change or manage only the new data to transfer if no direction
      change and with a final stop condition in both cases.

    - HAL_I2C_XFER_LAST_FRAME_NO_STOP: Sequential (master only), this option allows to manage a restart condition
      after several call of the same master sequential interface several times (link with option
      HAL_I2C_XFER_FIRST_AND_NEXT_FRAME).
      User can transfer several bytes one by one using :
        - HAL_I2C_MASTER_SEQ_Transmit_IT()
        - HAL_I2C_MASTER_SEQ_Receive_IT()
        - HAL_I2C_MASTER_SEQ_Transmit_DMA()
        - HAL_I2C_MASTER_SEQ_Receive_DMA() with option HAL_I2C_XFER_FIRST_AND_NEXT_FRAME then HAL_I2C_XFER_NEXT_FRAME.
      Then usage of this option HAL_I2C_XFER_LAST_FRAME_NO_STOP at the last Transmit or Receive sequence permit to
      call the opposite interface Receive or Transmit without stopping the communication and so generate a restart
      condition.

    - HAL_I2C_XFER_OTHER_FRAME: Sequential (master only), this option allows to manage a restart condition after each
      call of the same master sequential interface. User can transfer several bytes one by one with a restart with
      slave address between each byte using
        - HAL_I2C_MASTER_SEQ_Transmit_IT()
        - HAL_I2C_MASTER_SEQ_Receive_IT()
        - HAL_I2C_MASTER_SEQ_Transmit_DMA()
        - HAL_I2C_MASTER_SEQ_Receive_DMA() with option HAL_I2C_XFER_FIRST_FRAME then HAL_I2C_XFER_OTHER_FRAME.
      Then usage of this option HAL_I2C_XFER_OTHER_AND_LAST_FRAME at the last frame to help automatic
      generation of STOP condition.

  - Different sequential I2C interfaces are listed below:
    - Sequential transmit in master mode an amount of data in non-blocking mode using HAL_I2C_MASTER_SEQ_Transmit_IT()
      or using HAL_I2C_MASTER_SEQ_Transmit_DMA().
    - At transmission end of current frame transfer, HAL_I2C_MASTER_TxCpltCallback() is executed and user can add his
      own code by overriding this weak callback function or by registering a callback function.

    - Sequential receive in master I2C mode an amount of data in non-blocking mode using HAL_I2C_MASTER_SEQ_Receive_IT()
      or using HAL_I2C_MASTER_SEQ_Receive_DMA()
    - At reception end of current frame transfer, HAL_I2C_MASTER_RxCpltCallback() is executed and user can add his
      own code by overriding this weak callback function or by registering a callback function.

    - Abort a master or memory IT or DMA I2C process communication with interrupt using HAL_I2C_MASTER_Abort_IT()
    - End of abort process, HAL_I2C_AbortCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Enable/disable the Address listen mode in slave I2C mode with HAL_I2C_SLAVE_EnableListen_IT() and
      HAL_I2C_SLAVE_DisableListen_IT()

    - When address slave I2C match, HAL_I2C_SLAVE_AddrCallback() is executed and users can add their own code to check
      the address Match Code and the transmission direction request by master(Write/Read).

    - At Listen mode end HAL_I2C_SLAVE_ListenCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Sequential transmit in slave I2C mode an amount of data in non-blocking mode using HAL_I2C_SLAVE_SEQ_Transmit_IT()
      or using HAL_I2C_SLAVE_SEQ_Transmit_DMA()

    - At transmission end of current frame transfer, HAL_I2C_SLAVE_TxCpltCallback() is executed and user can add his
      own code by overriding this weak callback function or by registering a callback function.

    - Sequential receive in slave I2C mode an amount of data in non-blocking mode using HAL_I2C_SLAVE_SEQ_Receive_IT()
      or using HAL_I2C_SLAVE_SEQ_Receive_DMA()

    - At reception end of current frame transfer, HAL_I2C_SLAVE_RxCpltCallback() is executed and user can add his
      own code by overriding this weak callback function or by registering a callback function.

    - In case of transfer error, HAL_I2C_ErrorCallback() function is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Discard a slave I2C process communication using HAL_I2C_SLAVE_Abort_IT() macro. This action informs master to
      generate a Stop condition to discard the communication.

  - Interrupt mode IO MEM operation
    - Write an amount of data in non-blocking mode with interrupt to a specific memory address using
      HAL_I2C_MASTER_MemWrite_IT()
    - At Memory end of write transfer, HAL_I2C_MASTER_MemTxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - Read an amount of data in non-blocking mode with interrupt from a specific memory address using
      HAL_I2C_MASTER_MemRead_IT()
    - At Memory end of read transfer, HAL_I2C_MASTER_MemRxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.
    - In case of transfer error, HAL_I2C_ErrorCallback() function is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

