MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  - DMA mode IO operation
    - Transmit in master mode an amount of data in non-blocking mode (DMA) using HAL_I2C_MASTER_Transmit_DMA()

    - At transmission end of transfer, HAL_I2C_MASTER_TxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Receive in master mode an amount of data in non-blocking mode (DMA) using HAL_I2C_MASTER_Receive_DMA()

    - At reception end of transfer, HAL_I2C_MASTER_RxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Transmit in slave mode an amount of data in non-blocking mode (DMA) using HAL_I2C_SLAVE_Transmit_DMA()

    - At transmission end of transfer, HAL_I2C_SLAVE_TxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Receive in slave mode an amount of data in non-blocking mode (DMA) using HAL_I2C_SLAVE_Receive_DMA()

    - At reception end of transfer, HAL_I2C_SLAVE_RxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - In case of transfer error, HAL_I2C_ErrorCallback() function is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Abort a master or memory I2C process communication with interrupt using HAL_I2C_MASTER_Abort_IT()

    - End of abort process, HAL_I2C_AbortCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Discard a slave I2C process communication using HAL_I2C_SLAVE_Abort_IT() macro. This action informs master to
      generate a Stop condition to discard the communication.

  - DMA mode IO MEM operation

    - Write an amount of data in non-blocking mode with DMA to a specific memory address using
      HAL_I2C_MASTER_MemWrite_DMA()

    - At Memory end of write transfer, HAL_I2C_MASTER_MemTxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - Read an amount of data in non-blocking mode with DMA from a specific memory address using
      HAL_I2C_MASTER_MemRead_DMA()

    - At Memory end of read transfer, HAL_I2C_MASTER_MemRxCpltCallback() is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

    - In case of transfer error, HAL_I2C_ErrorCallback() function is executed and user can add his own code
      by overriding this weak callback function or by registering a callback function.

6. Callback registration definition in Interrupt
  - When the compilation define USE_HAL_I2C_REGISTER_CALLBACKS is set to 1, the user can configure dynamically the
    driver callbacks, via its own method:

  Callback name               | Default value                      | Callback registration function
  ----------------------------| ---------------------------------- | ---------------------------
  MASTER_TxCpltCallback       | HAL_I2C_MASTER_TxCpltCallback()    | HAL_I2C_MASTER_RegisterTxCpltCallback()
  MASTER_RxCpltCallback       | HAL_I2C_MASTER_RxCpltCallback()    | HAL_I2C_MASTER_RegisterRxCpltCallback()
  SLAVE_TxCpltCallback        | HAL_I2C_SLAVE_TxCpltCallback()     | HAL_I2C_SLAVE_RegisterTxCpltCallback()
  SLAVE_RxCpltCallback        | HAL_I2C_SLAVE_RxCpltCallback()     | HAL_I2C_SLAVE_RegisterRxCpltCallback()
  MASTER_MemTxCpltCallback    | HAL_I2C_MASTER_MemTxCpltCallback() | HAL_I2C_MASTER_RegisterMemTxCpltCallback()
  MASTER_MemRxCpltCallback    | HAL_I2C_MASTER_MemRxCpltCallback() | HAL_I2C_MASTER_RegisterMemRxCpltCallback()
  ListenCpltCallback          | HAL_I2C_SLAVE_ListenCpltCallback() | HAL_I2C_SLAVE_RegisterListenCpltCallback()
  AddrMatchCallback           | HAL_I2C_SLAVE_AddrCallback()       | HAL_I2C_SLAVE_RegisterAddrMatchCallback()
  AbortCpltCallback           | HAL_I2C_AbortCpltCallback()        | HAL_I2C_RegisterAbortCpltCallback()
  ErrorCallback               | HAL_I2C_ErrorCallback()            | HAL_I2C_RegisterErrorCallback()

  If one needs to unregister a callback, register the default callback via the registration function.

  By default, after the HAL_I2C_Init() and when the state is HAL_I2C_STATE_INIT, all callbacks are set to the
  corresponding default weak functions.

  Callbacks can be registered in handle global_state HAL_I2C_STATE_INIT and HAL_I2C_STATE_IDLE.

  When the compilation define USE_HAL_I2C_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration
  feature is not available and weak callbacks are used, represented by the default value in the table above.

7. Acquire/Release the i2c bus
  - When the compilation flag USE_HAL_MUTEX is set to 1, it allows the user to acquire/reserve the whole I2C bus for
    executing process .
    The HAL Acquire/Release are based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal) :
      - HAL_I2C_AcquireBus() for acquire the bus or wait for it.
      - HAL_I2C_ReleaseBus() for releasing the bus.

  - When the compilation flag USE_HAL_MUTEX is set to 0 or not defined, HAL_I2C_AcquireBus() and HAL_I2C_ReleaseBus()
    are not available.
  */
/**
  * @}
  */

/** @defgroup I2C_Configuration_Table I2C Configuration Table
  * @{
8. Configuration inside the I2C driver

Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags             |   Default value   | Comment
------------------------------ | ----------------- | ------------------------------------------------
USE_HAL_I2C_MODULE             |         1         | Enable HAL I2C driver module
USE_HAL_I2C_REGISTER_CALLBACKS |         0         | Allow the user to define their own callback
USE_HAL_I2C_DMA                |         1         | Enable DMA code inside I2C
USE_HAL_CHECK_PARAM            |         0         | Enable runtime parameter check
USE_HAL_I2C_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE    |         0         | Enable atomicity of process state check
USE_HAL_MUTEX                  |         0         | Enable semaphore creation for OS
USE_HAL_I2C_USER_DATA          |         0         | Add a user data inside HAL I2C handle
USE_HAL_I2C_GET_LAST_ERRORS    |         0         | Enable retrieval of last processes error codes

Software configuration defined in preprocessor environment:
Preprocessor flags             |   Default value   | Comment
------------------------------ | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM           |    Not defined    | Enable check param for HAL and LL
USE_ASSERT_DBG_STATE           |    Not defined    | Enable check state for HAL

  */
/**
  * @}
  */

