MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
/*Private types ------------------------------------------------------------*/
/** @defgroup I2C_Private_Types I2C Private Types
  * @{
  */

/**
  * @brief I2C start or stop mode.
  */
typedef enum
{
  I2C_NO_STARTSTOP            = (0x00000000U),                                            /*!< No start no stop */
  I2C_GENERATE_STOP           = (uint32_t)(0x80000000U | I2C_CR2_STOP),                   /*!< Stop */
  I2C_GENERATE_START_READ     = (uint32_t)(0x80000000U | I2C_CR2_START | I2C_CR2_RD_WRN), /*!< Start read */
  I2C_GENERATE_START_WRITE    = (uint32_t)(0x80000000U | I2C_CR2_START),                  /*!< Start write */
} i2c_start_stop_mode_t;
/**
  * @}
  */

/* Private defines -----------------------------------------------------------*/
/** @defgroup I2C_Private_Constants I2C Private Constants
  * @{
  */
#define XFER_NO_OPTION          (0xFFFF0000U)  /*!< Sequential transfer options default/reset value */
#define I2C_DEFAULT_TIMEOUT_MS  (25U)          /*!< 25 ms */
#define MAX_NBYTE_SIZE          (255U)           /*!< 255 */
#define SLAVE_ADDR_SHIFT        (7U)             /*!< 7 */
#define SLAVE_ADDR_MSK          (0x06U)          /*!< 6 */

/* Private define for @ref PreviousState usage */
#define I2C_STATE_NONE            (0U)        /*!< Default Value */
#define I2C_STATE_MASTER_BUSY_TX  (1UL << 0U) /*!< Master Busy TX */
#define I2C_STATE_MASTER_BUSY_RX  (1UL << 1U) /*!< Master Busy RX */
#define I2C_STATE_SLAVE_BUSY_TX   (1UL << 2U) /*!< Slave Busy TX */
#define I2C_STATE_SLAVE_BUSY_RX   (1UL << 3U) /*!< Memory Busy TX */

/**
  * @brief Private define to centralize the enable/disable of interrupts.
  */
#define I2C_FLAG_MASK (0x0001FFFFU) /*!< Flag mask */

/** @defgroup I2C_Interrupt_configuration I2C interrupt configuration for disable
  * @{
  */
#define I2C_XFER_TX_IT      0x0001U /*!< Bitfield can be combined with @ref I2C_XFER_LISTEN_IT */
#define I2C_XFER_RX_IT      0x0002U /*!< Bitfield can be combined with @ref I2C_XFER_LISTEN_IT */
#define I2C_XFER_LISTEN_IT  0x8000U /*!< Bitfield can be combined with @ref I2C_XFER_TX_IT and @ref I2C_XFER_RX_IT */
#define I2C_XFER_ERROR_IT   0x0010U /*!< Bit definition to manage addition of global Error and NACK treatment */
#define I2C_XFER_CPLT_IT    0x0020U /*!< Bit definition to manage only STOP event */
#define I2C_XFER_RELOAD_IT  0x0040U /*!< Bit definition to manage only Reload of NBYTE */
/**
  * @}
  */

/** @defgroup I2C_Interrupt_configuration_mask I2C interrupt configuration mask
  * @{
  */
/*! Mask can be combined with @ref I2C_XFER_LISTEN_IT_MASK */
#define I2C_XFER_TX_IT_MASK       (LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE \
                                   | LL_I2C_CR1_NACKIE | LL_I2C_CR1_TXIE)
/*! Mask can be combined with @ref I2C_XFER_LISTEN_IT_MASK */
#define I2C_XFER_RX_IT_MASK       (LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE \
                                   | LL_I2C_CR1_NACKIE | LL_I2C_CR1_RXIE)
/*! Mask can be combined with @ref I2C_XFER_TX_IT_MASK and @ref I2C_XFER_RX_IT_MASK */
#define I2C_XFER_LISTEN_IT_MASK   (LL_I2C_CR1_ADDRIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE | LL_I2C_CR1_ERRIE)
/*! Mask to manage addition of global Error and NACK treatment */
#define I2C_XFER_ERROR_IT_MASK    (LL_I2C_CR1_ERRIE | LL_I2C_CR1_NACKIE)
/*! Mask to manage only STOP event */
#define I2C_XFER_CPLT_IT_MASK     LL_I2C_CR1_STOPIE
#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/*! Mask to manage only STOP event with DMA */
#define I2C_XFER_CPLT_IT_DMA_MASK (LL_I2C_CR1_STOPIE | LL_I2C_CR1_TCIE)
#endif /* USE_HAL_I2C_DMA */
/*! Mask to manage only Reload of NBYTE */
#define I2C_XFER_RELOAD_IT_MASK  LL_I2C_CR1_TCIE
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup I2C_Private_Macros I2C Private Macros
  * @{
  */
/**
  * @brief Assert macro.
  */
#define IS_TRANSFER_REQUEST(request)  (((request) == I2C_GENERATE_STOP) \
                                       || ((request) == I2C_GENERATE_START_READ) \
                                       || ((request) == I2C_GENERATE_START_WRITE) \
                                       || ((request) == I2C_NO_STARTSTOP))

/**
  * @brief Assert macro.
  */
#define IS_I2C_ADDRESSING_MODE(mode) (((mode) == HAL_I2C_ADDRESSING_7BIT) \
                                      || ((mode) == HAL_I2C_ADDRESSING_10BIT))

/**
  * @brief Assert macro.
  */
#define IS_I2C_OWN_ADDRESS2_MASK(mask) (((mask) == HAL_I2C_OWN_ADDR2_NOMASK) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK01) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK02) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK03) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK04) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK05) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK06) \
                                        || ((mask) == HAL_I2C_OWN_ADDR2_MASK07))

/**
  * @brief Assert macro.
  */
#define IS_I2C_MEMADD_SIZE(size) (((size) == HAL_I2C_MEM_ADDR_8BIT) \
                                  || ((size) == HAL_I2C_MEM_ADDR_16BIT))

/**
  * @brief Assert macro.
  */
#define IS_TRANSFER_MODE(mode) (((mode) == LL_I2C_MODE_RELOAD) \
                                || ((mode) == LL_I2C_MODE_AUTOEND) \
                                || ((mode) == LL_I2C_MODE_SOFTEND))

/**
  * @brief Assert macro.
  */
#define IS_I2C_TRANSFER_OPTIONS_REQUEST(request) (((request) == HAL_I2C_XFER_FIRST_FRAME) \
                                                  || ((request) == HAL_I2C_XFER_FIRST_AND_NEXT_FRAME) \
                                                  || ((request) == HAL_I2C_XFER_NEXT_FRAME) \
                                                  || ((request) == HAL_I2C_XFER_FIRST_AND_LAST_FRAME) \
                                                  || ((request) == HAL_I2C_XFER_LAST_FRAME) \
                                                  || ((request) == HAL_I2C_XFER_LAST_FRAME_NO_STOP) \
                                                  || IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(request))

/**
  * @brief Assert macro.
  */
#define IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(request) (((request) == HAL_I2C_XFER_OTHER_FRAME) \
                                                        || ((request) == HAL_I2C_XFER_OTHER_AND_LAST_FRAME))
/**
  * @brief Reset CR2 macro.
  */
#define I2C_RESET_CR2(instance) ((instance)->CR2 &= (uint32_t)~((uint32_t)(I2C_CR2_SADD   | I2C_CR2_HEAD10R \
                                                                           | I2C_CR2_NBYTES | I2C_CR2_RELOAD \
                                                                           | I2C_CR2_RD_WRN)))

/**
  * @brief Assert macro
  * The device 7-bit address value must be  shifted left by 1 bit.
  * In other words, an 8-bit value is required and the bit 0  is not considered.
  */
#define IS_I2C_OWN_ADDRESS_7BIT(ADDRESS) ((ADDRESS) <= 0x00000FFU)

/**
  * @brief Assert macro.
  */
#define IS_I2C_OWN_ADDRESS_10BIT(ADDRESS) ((ADDRESS) <= 0x000003FFU)

/**
  * @brief Mem address add MSB.
  */
#define I2C_MEM_ADD_MSB(__ADDRESS__)((uint8_t)((uint32_t)(((uint32_t)((__ADDRESS__) & (uint32_t)(0xFF00U))) >> 8U)))

/**
  * @brief Mem address add LSB.
  */
#define I2C_MEM_ADD_LSB(__ADDRESS__) ((uint8_t)((uint32_t)((__ADDRESS__) & (uint32_t)(0x00FFU))))

/**
  * @brief Generate start.
  */
#define I2C_GENERATE_START(__ADDMODE__,__ADDRESS__) (((__ADDMODE__) == LL_I2C_ADDRESSING_MODE_7BIT) ? \
                                                     (uint32_t)((((uint32_t)(__ADDRESS__) & (I2C_CR2_SADD)) \
                                                                 | (I2C_CR2_START) | (I2C_CR2_AUTOEND)) \
                                                                & (~I2C_CR2_RD_WRN)) : \
                                                     (uint32_t)((((uint32_t)(__ADDRESS__) & (I2C_CR2_SADD))\
                                                                 | (I2C_CR2_ADD10) | (I2C_CR2_START) \
                                                                 | (I2C_CR2_AUTOEND)) & (~I2C_CR2_RD_WRN)))

/**
  * @brief Check flag.
  */
#define I2C_CHECK_FLAG(isr, flag) ((((isr) & (flag)) == (flag)) ? 1U : 0U)

/**
  * @brief Check IT source.
  */
#define I2C_CHECK_IT_SOURCE(cr1, it)  ((((cr1) & (it)) == (it)) ? 1U : 0U)

/**
  * @brief Assert macro.
  */
#define IS_I2C_DIGITAL_FILTER(filter)  ((filter) <= 0x0000000FU)

/**
  * @brief Retrieve I2C instance from handle.
  */
#define I2C_GET_INSTANCE(handle) \
  ((I2C_TypeDef *)((uint32_t)((handle)->instance))) /*!< Retrieve I2C instance from handle */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/

