MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
/* Private functions prototypes ----------------------------------------------*/
/** @defgroup I2C_Private_Functions I2C Private Functions
  * @{
  */
#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/* Handle DMA transfer */
static void I2C_DMAMasterTransmitCplt(hal_dma_handle_t *hdma);
static void I2C_DMAMasterReceiveCplt(hal_dma_handle_t *hdma);
static void I2C_DMASlaveTransmitCplt(hal_dma_handle_t *hdma);
static void I2C_DMASlaveReceiveCplt(hal_dma_handle_t *hdma);
static void I2C_DMAError(hal_dma_handle_t *hdma);
static void I2C_DMAAbort(hal_dma_handle_t *hdma);
#endif /* USE_HAL_I2C_DMA */

/* Handle IT transfer */
static void I2C_ITAddrCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags);
static void I2C_ITMasterSeqCplt(hal_i2c_handle_t *hi2c);
static void I2C_ITSlaveSeqCplt(hal_i2c_handle_t *hi2c);
static void I2C_ITMasterCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags);
static void I2C_ITSlaveCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags);
static void I2C_ITListenCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags);
static void I2C_ITError(hal_i2c_handle_t *hi2c, uint32_t error_code);

/* Handle IT transfer */
static hal_status_t I2C_RequestMemoryWrite(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                           hal_i2c_mem_addr_size_t memory_addr_size,
                                           uint32_t timeout_ms, uint32_t tick_start);
static hal_status_t I2C_RequestMemoryRead(hal_i2c_handle_t *hi2c, uint32_t device_addr,
                                          uint32_t memory_addr, hal_i2c_mem_addr_size_t memory_addr_size,
                                          uint32_t timeout_ms, uint32_t tick_start);

/* Private functions for I2C transfer IRQ handler */
static hal_status_t I2C_Master_ISR_IT(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources);
static hal_status_t I2C_Mem_ISR_IT(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources);
static hal_status_t I2C_Slave_ISR_IT(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources);
#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
static hal_status_t I2C_Master_ISR_DMA(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources);
static hal_status_t I2C_Mem_ISR_DMA(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources);
static hal_status_t I2C_Slave_ISR_DMA(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources);
#endif /* USE_HAL_I2C_DMA */

/* Handle flags during polling transfer */
static hal_status_t I2C_WaitOnFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t flag, uint32_t status,
                                               uint32_t timeout_ms, uint32_t tick_start);
static hal_status_t I2C_WaitOnTXISFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t timeout_ms, uint32_t tick_start);
static hal_status_t I2C_WaitOnRXNEFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t timeout_ms, uint32_t tick_start);
static hal_status_t I2C_WaitOnSTOPFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t timeout_ms, uint32_t tick_start);
static hal_status_t I2C_IsErrorOccurred(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t timeout_ms,
                                        uint32_t tick_start);

/* Centralize the disable of interrupts */
static void I2C_Disable_IRQ(hal_i2c_handle_t *hi2c, uint32_t it_request);

/* Handle different error callbacks */
static void I2C_TreatErrorCallback(hal_i2c_handle_t *hi2c);

/* Flush TXDR register */
static void I2C_Flush_TXDR(I2C_TypeDef *p_i2cx);

/* Handle start, restart, or stop a transfer */
static void I2C_TransferConfig(I2C_TypeDef *p_i2cx, uint32_t device_addr, uint32_t size_byte, uint32_t mode,
                               i2c_start_stop_mode_t request);

/* Convert specific options */
static void I2C_ConvertOtherXferOptions(hal_i2c_handle_t *hi2c);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup I2C_Exported_Functions
  * @{
  */

/** @addtogroup I2C_Exported_Functions_Group1
  * @{
A set of functions to initialize and deinitialize the I2Cx peripheral:
 - HAL_I2C_Init(): initialize the selected device with the I2C instance.
 - HAL_I2C_DeInit(): restore the default configuration of the selected I2Cx peripheral.
  */

/**
  * @brief  Initialize the I2C according to the associated handle.
  * @param  hi2c Pointer to a hal_i2c_handle_t.
  * @param  instance HAL I2C instance.
  * @retval HAL_OK HAL I2C instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM HAL I2C instance is NULL.
  * @retval HAL_ERROR HAL I2C semaphore creation failed (USE_HAL_MUTEX is set to 1).
  */
hal_status_t HAL_I2C_Init(hal_i2c_handle_t *hi2c, hal_i2c_t instance)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM(IS_I2C_ALL_INSTANCE((I2C_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hi2c == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->instance = instance;

#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
  /* I2C Callbacks to the weak function */
  hi2c->p_master_tx_cplt_cb    = HAL_I2C_MASTER_TxCpltCallback;
  hi2c->p_master_rx_cplt_cb    = HAL_I2C_MASTER_RxCpltCallback;
  hi2c->p_slave_tx_cplt_cb     = HAL_I2C_SLAVE_TxCpltCallback;
  hi2c->p_slave_rx_cplt_cb     = HAL_I2C_SLAVE_RxCpltCallback;
  hi2c->p_slave_listen_cplt_cb = HAL_I2C_SLAVE_ListenCpltCallback;
  hi2c->p_mem_tx_cplt_cb       = HAL_I2C_MASTER_MemTxCpltCallback;
  hi2c->p_mem_rx_cplt_cb       = HAL_I2C_MASTER_MemRxCpltCallback;
  hi2c->p_abort_cplt_cb        = HAL_I2C_AbortCpltCallback;
  hi2c->p_error_cb             = HAL_I2C_ErrorCallback;
  hi2c->p_slave_addr_cb        = HAL_I2C_SLAVE_AddrCallback;
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */

  /* Private fields */
  hi2c->p_buf_rx = (uint8_t *) NULL;
  hi2c->p_buf_tx = (const uint8_t *) NULL;
  hi2c->xfer_size = 0U;
  hi2c->xfer_count = 0U;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) 0U;
  hi2c->xfer_isr = NULL;
  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;
  hi2c->addr_event_count = 0U;
  hi2c->dev_addr = 0U;
  hi2c->mem_addr = 0U;

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
  hi2c->hdma_tx = (hal_dma_handle_t *) NULL;
  hi2c->hdma_rx = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_I2C_DMA */

#if defined (USE_HAL_I2C_USER_DATA) && (USE_HAL_I2C_USER_DATA == 1)
  hi2c->p_user_data = (void *) NULL;
#endif /* USE_HAL_I2C_USER_DATA */

#if defined(USE_HAL_I2C_CLK_ENABLE_MODEL) && (USE_HAL_I2C_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable I2Cx Clock */
  switch (instance)
  {
    case HAL_I2C1:
      HAL_RCC_I2C1_EnableClock();
      break;
#if defined(I2C2)
    case HAL_I2C2:
      HAL_RCC_I2C2_EnableClock();
      break;
#endif /* I2C2 */
    default:
      break;
  }
#endif /* USE_HAL_I2C_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  if (HAL_OS_SemaphoreCreate(&hi2c->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  hi2c->global_state = HAL_I2C_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the HAL I2C driver for the given handle and disable the peripheral.
  * @param  hi2c pointer to a hal_i2c_handle_t structure.
  */
void HAL_I2C_DeInit(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;
  hal_i2c_state_t temp_state;
  uint32_t count = I2C_DEFAULT_TIMEOUT_MS;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_INIT        \
                                        | HAL_I2C_STATE_IDLE      \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  temp_state = hi2c->global_state;

  if ((temp_state != HAL_I2C_STATE_IDLE) && (temp_state != HAL_I2C_STATE_INIT))
  {
#if defined(USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
    if (LL_I2C_IsEnabledDMAReq_TX(p_i2cx) != 0U)
    {
      if (hi2c->hdma_tx != NULL)
      {
        (void)HAL_DMA_Abort(hi2c->hdma_tx);
      }
    }

