MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
    if (LL_I2C_IsEnabledDMAReq_RX(p_i2cx) != 0U)
    {
      if (hi2c->hdma_rx != NULL)
      {
        (void)HAL_DMA_Abort(hi2c->hdma_rx);
      }
    }
#endif /* USE_HAL_I2C_DMA */

    if (hi2c->mode == (hal_i2c_mode_t)HAL_I2C_MODE_SLAVE)
    {
      LL_I2C_AcknowledgeNextData(p_i2cx, LL_I2C_NACK);
    }
    else
    {
      LL_I2C_GenerateStopCondition(p_i2cx);
    }
    /* Wait for the transfer to stop */
    do
    {
      count--;
      if (count == 0U)
      {
        break;
      }
    } while (LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U);
  }

  LL_I2C_Disable(p_i2cx);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&hi2c->semaphore);
#endif /* USE_HAL_MUTEX */

  hi2c->global_state = HAL_I2C_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup I2C_Exported_Functions_Group2
  * @{
A set of functions allowing to configure the I2Cx peripheral:

- Global configuration :
  - HAL_I2C_SetConfig()
  - HAL_I2C_GetConfig()

- Unitary configuration :
  - HAL_I2C_SetTiming()
  - HAL_I2C_GetTiming()

- Filter mode:
  - HAL_I2C_EnableAnalogFilter()
  - HAL_I2C_DisableAnalogFilter()
  - HAL_I2C_IsEnabledAnalogFilter()
  - HAL_I2C_SetDigitalFilter()
  - HAL_I2C_GetDigitalFilter()

- Wake-up from Stop mode(s):
  - HAL_I2C_SLAVE_EnableWakeUp()
  - HAL_I2C_SLAVE_DisableWakeUp()
  - HAL_I2C_SLAVE_IsEnabledWakeUp()

- Fast mode plus driving capability:
  - HAL_I2C_EnableFastModePlus()
  - HAL_I2C_DisableFastModePlus()
  - HAL_I2C_IsEnabledFastModePlus()

  */

/**
  * @brief  Configure the I2C according to the user parameters.
  * @param  hi2c Pointer to a hal_i2c_handle_t.
  * @param  p_config Pointer to the configuration structure.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_I2C_SetConfig(hal_i2c_handle_t *hi2c, const hal_i2c_config_t *p_config)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_I2C_ADDRESSING_MODE(p_config->addressing_mode));
  ASSERT_DBG_PARAM((p_config->addressing_mode == HAL_I2C_ADDRESSING_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(p_config->own_address1) :
                   IS_I2C_OWN_ADDRESS_10BIT(p_config->own_address1));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);

  /* Configure I2Cx Frequency range */
  LL_I2C_SetTiming(p_i2cx, p_config->timing);

  /* Disable I2Cx Own Address1 and clear I2Cx Own Address1 mode */
  LL_I2C_DisableOwnAddress1AndMode(p_i2cx);

  /* Configure I2Cx Own Address1 and ack own address1 mode */
  if (p_config->addressing_mode == HAL_I2C_ADDRESSING_7BIT)
  {
    LL_I2C_ConfigOwnAddress1(p_i2cx, p_config->own_address1, LL_I2C_OWNADDRESS1_7BIT);
  }
  else /* HAL_I2C_ADDRESSING_10BIT */
  {
    LL_I2C_ConfigOwnAddress1(p_i2cx, p_config->own_address1, LL_I2C_OWNADDRESS1_10BIT);
  }

  /* Configure I2Cx addressing master mode */
  LL_I2C_SetMasterAddressingMode(p_i2cx, (uint32_t)p_config->addressing_mode);

  /* Enable the I2Cx AUTOEND by default, and enable NACK (must be disable only during slave process) */
  LL_I2C_WRITE_REG(p_i2cx, CR2, (LL_I2C_READ_REG(p_i2cx, CR2) | I2C_CR2_AUTOEND | I2C_CR2_NACK));

  LL_I2C_Enable(p_i2cx);

  hi2c->global_state = HAL_I2C_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Retrieve the I2C configuration.
  * @param  hi2c Pointer to a hal_i2c_handle_t.
  * @param  p_config Pointer to the configuration structure.
  */
void HAL_I2C_GetConfig(const hal_i2c_handle_t *hi2c, hal_i2c_config_t *p_config)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  p_config->timing = LL_I2C_GetTiming(p_i2cx);

  p_config->addressing_mode = (hal_i2c_addressing_mode_t)
                              LL_I2C_GetMasterAddressingMode(p_i2cx);

  p_config->own_address1 = LL_I2C_GetOwnAddress1(p_i2cx);
}

/**
  * @brief  Set the I2C Timing.
  * @param  hi2c  Pointer to a hal_i2c_handle_t
  * @param  value I2C timing
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SetTiming(hal_i2c_handle_t *hi2c, uint32_t value)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_SetTiming(p_i2cx, value);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Get the I2C Timing.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval uint32_t I2C timing value
  */
uint32_t HAL_I2C_GetTiming(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  return LL_I2C_GetTiming(I2C_GET_INSTANCE(hi2c));
}

/**
  * @brief  Enable I2C Analog noise filter.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_EnableAnalogFilter(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableAnalogFilter(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable I2C Analog noise filter.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_DisableAnalogFilter(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableAnalogFilter(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check I2C analog noise filter status.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_I2C_ANALOG_FILTER_ENABLED  Analog Filter is enabled
  * @retval HAL_I2C_ANALOG_FILTER_DISABLED Analog Filter is disabled
  */
hal_i2c_analog_filter_status_t HAL_I2C_IsEnabledAnalogFilter(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  return (hal_i2c_analog_filter_status_t) LL_I2C_IsEnabledAnalogFilter(I2C_GET_INSTANCE(hi2c));
}

/**
  * @brief  Set the I2C Digital noise filter.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  noise_filtering_in_bus_clk_period Coefficient of digital noise filter between Min_Data=0x00
  *         and Max_Data=0x0F.
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SetDigitalFilter(hal_i2c_handle_t *hi2c, uint32_t noise_filtering_in_bus_clk_period)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM(IS_I2C_DIGITAL_FILTER(noise_filtering_in_bus_clk_period));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_SetDigitalFilter(p_i2cx, noise_filtering_in_bus_clk_period);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Get the I2C Digital noise filter.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval uint32_t Coefficient of digital noise filter between Min_Data=0x00 and Max_Data=0x0F.
  */
uint32_t HAL_I2C_GetDigitalFilter(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

