MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  return LL_I2C_GetDigitalFilter(I2C_GET_INSTANCE(hi2c));
}

/**
  * @brief  Enable I2C slave wakeup from Stop mode(s).
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_EnableWakeUp(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableWakeUpFromStop(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable slave I2C wakeup from Stop mode(s).
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_DisableWakeUp(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableWakeUpFromStop(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check slave I2C wake up feature status.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_I2C_SLAVE_WAKE_UP_ENABLED  Slave Wake Up is enabled
  * @retval HAL_I2C_SLAVE_WAKE_UP_DISABLED Slave Wake Up is disabled
  */
hal_i2c_slave_wake_up_status_t HAL_I2C_SLAVE_IsEnabledWakeUp(const hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  ASSERT_DBG_PARAM((hi2c != NULL));

  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  return (hal_i2c_slave_wake_up_status_t) LL_I2C_IsEnabledWakeUpFromStop(p_i2cx);
}

/**
  * @brief  Enable I2C fast mode plus.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_EnableFastModePlus(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableFastModePlus(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable I2C fast mode plus.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_DisableFastModePlus(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableFastModePlus(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check I2C fast mode plus feature status.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_I2C_FAST_MODE_PLUS_ENABLED    Fast mode plus enabled
  * @retval HAL_I2C_FAST_MODE_PLUS_DISABLED   Fast mode plus disabled
  */
hal_i2c_fast_mode_plus_status_t HAL_I2C_IsEnabledFastModePlus(const hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  p_i2cx = I2C_GET_INSTANCE(hi2c);

  return (hal_i2c_fast_mode_plus_status_t) LL_I2C_IsEnabledFastModePlus(p_i2cx);
}

/**
  * @brief  Enable slave I2C clock Stretching.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @note   The stretching mode is already enabled after a I2C HW reset
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_EnableClockStretching(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableClockStretching(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable slave I2C clock Stretching.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_DisableClockStretching(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableClockStretching(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check slave clock Stretching status.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_I2C_SLAVE_STRETCH_ENABLED  Slave stretch mode enabled
  * @retval HAL_I2C_SLAVE_STRETCH_DISABLED Slave stretch mode disabled
  */
hal_i2c_slave_stretch_mode_status_t HAL_I2C_SLAVE_IsEnabledClockStretching(const hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

