MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  return (hal_i2c_slave_stretch_mode_status_t)LL_I2C_IsEnabledClockStretching(p_i2cx);
}

/**
  * @brief  Enable slave I2C Acknowledge General Call.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_EnableAckGeneralCall(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableGeneralCall(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable I2C slave Acknowledge General Call.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_DisableAckGeneralCall(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableGeneralCall(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check slave Acknowledge General Call status.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_I2C_SLAVE_ACK_GENERAL_CALL_ENABLED  Slave Acknowledge General Call is enabled
  * @retval HAL_I2C_SLAVE_ACK_GENERAL_CALL_DISABLED Slave Acknowledge General Call is disabled
  */
hal_i2c_slave_ack_general_call_status_t HAL_I2C_SLAVE_IsEnabledAckGeneralCall(const hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  return (hal_i2c_slave_ack_general_call_status_t)LL_I2C_IsEnabledGeneralCall(p_i2cx);
}

/**
  * @brief  Set the I2C own address2 configuration.
  * @param  hi2c  Pointer to a hal_i2c_handle_t.
  * @param  addr  The second device own address. It is a 7-bit address but the value must be shifted left by 1 bit.
                  In other words, an 8-bit value is required and the bit 0 is not considered.
  * @param  mask  Acknowledge mask address second device own address.
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SetConfigOwnAddress2(hal_i2c_handle_t *hi2c, uint32_t addr, hal_i2c_own_addr2_mask_t mask)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM(IS_I2C_OWN_ADDRESS_7BIT(addr));
  ASSERT_DBG_PARAM(IS_I2C_OWN_ADDRESS2_MASK(mask));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_SetOwnAddress2(p_i2cx, addr, (uint32_t)mask);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Get the I2C own address2 configuration.
  * @param  hi2c  Pointer to a hal_i2c_handle_t.
  * @param  addr  The second device own address. It is a 7-bit address but the value must is shifted left by 1 bit.
                  In other words, an 8-bit value is returned and the bit 0 is not considered.
  * @param  mask  Acknowledge mask address second device own address.
  */
void HAL_I2C_GetConfigOwnAddress2(const hal_i2c_handle_t *hi2c, uint32_t *addr, hal_i2c_own_addr2_mask_t *mask)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((addr != NULL));
  ASSERT_DBG_PARAM((mask != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  *addr = LL_I2C_GetOwnAddress2(p_i2cx);
  *mask = (hal_i2c_own_addr2_mask_t) LL_I2C_GetOwnAddress2Mask(p_i2cx);
}

/**
  * @brief  Enable I2C Own Address2.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_EnableOwnAddress2(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableOwnAddress2(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable I2C Own Address2.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_DisableOwnAddress2(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_IDLE);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableOwnAddress2(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check own address 2 status.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_I2C_OWN_ADDR2_ENABLED   Dual addressing is enabled
  * @retval HAL_I2C_OWN_ADDR2_DISABLED  Dual addressing is disabled
  */
hal_i2c_own_addr2_status_t HAL_I2C_IsEnabledOwnAddress2(const hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  return (hal_i2c_own_addr2_status_t)LL_I2C_IsEnabledOwnAddress2(p_i2cx);
}

#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the I2C master Tx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the master Tx transfer completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_RegisterTxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

  hi2c->p_master_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C master Rx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the master Rx transfer completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_RegisterRxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_master_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C slave Tx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the slave Tx transfer completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SLAVE_RegisterTxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_slave_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C slave Rx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the slave Rx transfer completed callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SLAVE_RegisterRxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_slave_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C Listen Complete callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the I2C Listen Complete callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SLAVE_RegisterListenCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_slave_listen_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C Memory Tx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the I2C Memory Tx transfer completed callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_RegisterMemTxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_mem_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C Memory Rx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the I2C Memory Rx transfer completed callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_RegisterMemRxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_mem_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C Abort completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the I2C Abort completed callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_RegisterAbortCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C slave Address Match  callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the I2C slave Address Match  callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SLAVE_RegisterAddrMatchCallback(hal_i2c_handle_t *hi2c, hal_i2c_slave_addr_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

