MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  hi2c->p_slave_addr_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the I2C Error callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_callback pointer to the I2C Error callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_RegisterErrorCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2c->p_error_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/**
  * @brief  Link the Transmit DMA handle to the I2C handle.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  hdma Pointer to a hal_dma_handle_t structure
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SetTxDMA(hal_i2c_handle_t *hi2c, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Link the DMA handle to the I2C handle */
  hi2c->hdma_tx = hdma;
  hdma->p_parent = hi2c;

  return HAL_OK;
}

/**
  * @brief  Link the Receive DMA handle to the I2C handle.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  hdma Pointer to a hal_dma_handle_t structure
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SetRxDMA(hal_i2c_handle_t *hi2c, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (uint32_t)HAL_I2C_STATE_INIT | (uint32_t)HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* link the DMA handle to the I2C handle */
  hi2c->hdma_rx = hdma;
  hdma->p_parent = hi2c;

  return HAL_OK;
}
#endif /* USE_HAL_I2C_DMA */
/**
  * @}
  */

/** @addtogroup I2C_Exported_Functions_Group3
  * @{
A set of functions allowing to manage the I2C data transfers.

- There are two modes of transfer:
  - Blocking mode : The communication is performed in the polling mode.
    The status of all data processing is returned by the same function after finishing transfer.
  - No-Blocking mode : The communication is performed using interrupts or DMA.
    These functions return the status of the transfer startup.
    The end of the data processing is indicated through the dedicated I2C IRQ when using interrupt
      mode or the DMA IRQ when using DMA mode.

- Blocking mode functions are :
  - HAL_I2C_MASTER_Transmit()
  - HAL_I2C_MASTER_Receive()
  - HAL_I2C_MASTER_MemWrite()
  - HAL_I2C_MASTER_MemRead()
  - HAL_I2C_MASTER_PollForSlaveReady()
  - HAL_I2C_SLAVE_Transmit()
  - HAL_I2C_SLAVE_Receive()

- No-Blocking mode functions with interrupt are :
  - HAL_I2C_MASTER_Transmit_IT()
  - HAL_I2C_MASTER_Receive_IT()
  - HAL_I2C_SLAVE_Transmit_IT()
  - HAL_I2C_SLAVE_Receive_IT()
  - HAL_I2C_MASTER_MemWrite_IT()
  - HAL_I2C_MASTER_MemRead_IT()
  - HAL_I2C_MASTER_SEQ_Transmit_IT()
  - HAL_I2C_MASTER_SEQ_Receive_IT()
  - HAL_I2C_SLAVE_SEQ_Transmit_IT()
  - HAL_I2C_SLAVE_SEQ_Receive_IT()
  - HAL_I2C_SLAVE_EnableListen_IT()
  - HAL_I2C_SLAVE_DisableListen_IT()
  - HAL_I2C_MASTER_Abort_IT()
  - HAL_I2C_SLAVE_Abort_IT()

- No-Blocking mode functions with DMA are :
  - HAL_I2C_MASTER_Transmit_DMA()
  - HAL_I2C_MASTER_Receive_DMA()
  - HAL_I2C_SLAVE_Transmit_DMA()
  - HAL_I2C_SLAVE_Receive_DMA()
  - HAL_I2C_MASTER_MemWrite_DMA()
  - HAL_I2C_MASTER_MemRead_DMA()
  - HAL_I2C_MASTER_SEQ_Transmit_DMA()
  - HAL_I2C_MASTER_SEQ_Receive_DMA()
  - HAL_I2C_SLAVE_SEQ_Transmit_DMA()
  - HAL_I2C_SLAVE_SEQ_Receive_DMA()

- A set of transfer weak complete callbacks are provided in non Blocking mode:
  - HAL_I2C_MASTER_TxCpltCallback()
  - HAL_I2C_MASTER_RxCpltCallback()
  - HAL_I2C_SLAVE_TxCpltCallback()
  - HAL_I2C_SLAVE_RxCpltCallback()
  - HAL_I2C_MASTER_MemTxCpltCallback()
  - HAL_I2C_MASTER_MemRxCpltCallback()
  - HAL_I2C_SLAVE_AddrCallback()
  - HAL_I2C_SLAVE_ListenCpltCallback()
  - HAL_I2C_ErrorCallback()
  - HAL_I2C_AbortCpltCallback()
  */

/**
  * @brief  Transmit in master mode an amount of data in blocking mode.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  timeout_ms Timeout duration in millisecond
  * @retval HAL_OK            Operation completed successfully
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  */
hal_status_t HAL_I2C_MASTER_Transmit(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                     uint32_t size_byte, uint32_t timeout_ms)
{
  I2C_TypeDef *p_i2cx;
  uint32_t tick_start;
  hal_status_t hal_status;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

