MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_BUSY, 1U, I2C_DEFAULT_TIMEOUT_MS, tick_start);
  if (hal_status == HAL_OK)
  {
    hi2c->mode = HAL_I2C_MODE_MASTER;
    hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

    /* Prepare transfer parameters */
    hi2c->p_buf_tx = (const uint8_t *)p_data;
    hi2c->xfer_count = size_byte;
    hi2c->xfer_isr = NULL;

    /* Send slave address */
    /* Set NBYTES to write and reload if hi2c->xfer_count > MAX_NBYTE_SIZE and generate RESTART */
    if (hi2c->xfer_count > MAX_NBYTE_SIZE)
    {
      hi2c->xfer_size = MAX_NBYTE_SIZE;
      I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_GENERATE_START_WRITE);
    }
    else
    {
      hi2c->xfer_size = hi2c->xfer_count;
      I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_GENERATE_START_WRITE);
    }

    while (hi2c->xfer_count > 0U)
    {
      hal_status = I2C_WaitOnTXISFlagUntilTimeout(hi2c, timeout_ms, tick_start);
      if (hal_status == HAL_OK)
      {
        /* Write data to TXDR */
        LL_I2C_TransmitData8(p_i2cx, *hi2c->p_buf_tx);
        hi2c->p_buf_tx++;
        hi2c->xfer_count--;
        hi2c->xfer_size--;

        if ((hi2c->xfer_count != 0U) && (hi2c->xfer_size == 0U))
        {
          /* Wait until TCR flag is set */
          hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_TCR, 0U, timeout_ms, tick_start);
          if (hal_status == HAL_OK)
          {
            if (hi2c->xfer_count > MAX_NBYTE_SIZE)
            {
              hi2c->xfer_size = MAX_NBYTE_SIZE;
              I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_NO_STARTSTOP);
            }
            else
            {
              hi2c->xfer_size = hi2c->xfer_count;
              I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_NO_STARTSTOP);
            }
          }
        }
      }

      if (hal_status != HAL_OK)
      {
        break;
      }
    } /* End of while */

    if (hal_status == HAL_OK)
    {
      /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
      /* Wait until STOPF flag is set */
      hal_status = I2C_WaitOnSTOPFlagUntilTimeout(hi2c, timeout_ms, tick_start);
      if (hal_status == HAL_OK)
      {
        LL_I2C_ClearFlag_STOP(p_i2cx);
        I2C_RESET_CR2(p_i2cx);
      }
    }
  }

  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->global_state = HAL_I2C_STATE_IDLE;

  return hal_status;
}

/**
  * @brief  Receive in master mode an amount of data in blocking mode.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  timeout_ms  Timeout duration in millisecond
  * @retval HAL_OK            Operation completed successfully
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  */
hal_status_t HAL_I2C_MASTER_Receive(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                    uint32_t size_byte, uint32_t timeout_ms)
{
  I2C_TypeDef *p_i2cx;
  uint32_t tick_start;
  hal_status_t hal_status;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_RX);

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_BUSY, 1U, I2C_DEFAULT_TIMEOUT_MS, tick_start);
  if (hal_status == HAL_OK)
  {
    hi2c->mode = HAL_I2C_MODE_MASTER;
    hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

    /* Prepare transfer parameters */
    hi2c->p_buf_rx = (uint8_t *)p_data;
    hi2c->xfer_count = size_byte;
    hi2c->xfer_isr = NULL;

    /* Send slave address */
    /* Set NBYTES to write and reload if hi2c->xfer_count > MAX_NBYTE_SIZE and generate RESTART */
    if (hi2c->xfer_count > MAX_NBYTE_SIZE)
    {
      hi2c->xfer_size = MAX_NBYTE_SIZE;
      I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_GENERATE_START_READ);
    }
    else
    {
      hi2c->xfer_size = hi2c->xfer_count;
      I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_GENERATE_START_READ);
    }

    while (hi2c->xfer_count > 0U)
    {
      /* Wait until RXNE flag is set */
      hal_status = I2C_WaitOnRXNEFlagUntilTimeout(hi2c, timeout_ms, tick_start);
      if (hal_status == HAL_OK)
      {
        /* Read data from RXDR */
        *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
        hi2c->p_buf_rx++;
        hi2c->xfer_size--;
        hi2c->xfer_count--;

        if ((hi2c->xfer_count != 0U) && (hi2c->xfer_size == 0U))
        {
          /* Wait until TCR flag is set */
          hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_TCR, 0U, timeout_ms, tick_start);
          if (hal_status == HAL_OK)
          {
            if (hi2c->xfer_count > MAX_NBYTE_SIZE)
            {
              hi2c->xfer_size = MAX_NBYTE_SIZE;
              I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_NO_STARTSTOP);
            }
            else
            {
              hi2c->xfer_size = hi2c->xfer_count;
              I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_NO_STARTSTOP);
            }
          }
        }
      }

      if (hal_status != HAL_OK)
      {
        break;
      }
    } /* End of while */

    if (hal_status == HAL_OK)
    {
      /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
      /* Wait until STOPF flag is set */
      hal_status = I2C_WaitOnSTOPFlagUntilTimeout(hi2c, timeout_ms, tick_start);
      if (hal_status == HAL_OK)
      {
        LL_I2C_ClearFlag_STOP(p_i2cx);
        I2C_RESET_CR2(p_i2cx);
      }
    }
  }

  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->global_state = HAL_I2C_STATE_IDLE;

  return hal_status;
}

/**
  * @brief  Transmit in slave mode an amount of data in blocking mode.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  timeout_ms Timeout duration in millisecond
  * @retval HAL_OK            Operation completed successfully
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  */
hal_status_t HAL_I2C_SLAVE_Transmit(hal_i2c_handle_t *hi2c, const void *p_data, uint32_t size_byte,
                                    uint32_t timeout_ms)
{
  I2C_TypeDef *p_i2cx;
  uint32_t tick_start;
  hal_status_t hal_status;

  ASSERT_DBG_PARAM((hi2c != NULL) && (p_data != NULL) && (size_byte != 0UL));
  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

