MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  hi2c->mode = HAL_I2C_MODE_SLAVE;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_tx = (const uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_isr = NULL;

  LL_I2C_AcknowledgeEnable(p_i2cx);

  /* Wait until ADDR flag is set */
  hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_ADDR, 0U, timeout_ms, tick_start);
  if (hal_status == HAL_OK)
  {
    /* Preload TX data if no stretch enable */
    if (LL_I2C_IsEnabledClockStretching(p_i2cx) == 0UL)
    {
      /* Preload TX register and Write data to TXDR */
      LL_I2C_TransmitData8(p_i2cx, *hi2c->p_buf_tx);
      hi2c->p_buf_tx++;
      hi2c->xfer_count--;
    }

    LL_I2C_ClearFlag_ADDR(p_i2cx);

    /* If 10bit addressing mode is selected */
    if ((hal_i2c_addressing_mode_t)LL_I2C_GetMasterAddressingMode(p_i2cx) == HAL_I2C_ADDRESSING_10BIT)
    {
      /* Wait until ADDR flag is set */
      hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_ADDR, 0U, timeout_ms, tick_start);
      if (hal_status == HAL_OK)
      {
        LL_I2C_ClearFlag_ADDR(p_i2cx);
      }
    }

    if (hal_status == HAL_OK)
    {
      /* Wait until DIR flag is set Transmitter mode */
      hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_DIR, 0U, timeout_ms, tick_start);
      if (hal_status == HAL_OK)
      {
        while (hi2c->xfer_count > 0U)
        {
          hal_status = I2C_WaitOnTXISFlagUntilTimeout(hi2c, timeout_ms, tick_start);
          if (hal_status != HAL_OK)
          {
            break;
          }

          /* Write data to TXDR */
          LL_I2C_TransmitData8(p_i2cx, *hi2c->p_buf_tx);
          hi2c->p_buf_tx++;
          hi2c->xfer_count--;
        }

        /* Wait until AF flag is set */
        if (hal_status == HAL_OK)
        {
          hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_NACKF, 0U, timeout_ms, tick_start);
          if (hal_status == HAL_OK)
          {
            I2C_Flush_TXDR(p_i2cx);

            LL_I2C_ClearFlag_NACK(p_i2cx);

            /* Wait until STOP flag is set */
            hal_status = I2C_WaitOnSTOPFlagUntilTimeout(hi2c, timeout_ms, tick_start);
            if (hal_status == HAL_OK)
            {
              LL_I2C_ClearFlag_STOP(p_i2cx);

              /* Wait until BUSY flag is reset */
              hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_BUSY, 1U, timeout_ms, tick_start);
            }
          }
        }
      }
    }
  }

  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->global_state = HAL_I2C_STATE_IDLE;

  return hal_status;
}

/**
  * @brief  Receive in slave mode an amount of data in blocking mode.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  timeout_ms Timeout duration in millisecond
  * @retval HAL_OK            Operation completed successfully
  * @retval HAL_ERROR         Operation completed with error
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_TIMEOUT       Operation exceeds user timeout
  */
hal_status_t HAL_I2C_SLAVE_Receive(hal_i2c_handle_t *hi2c, void *p_data, uint32_t size_byte, uint32_t timeout_ms)
{
  I2C_TypeDef *p_i2cx;
  uint32_t tick_start;
  hal_status_t hal_status;

  ASSERT_DBG_PARAM((hi2c != NULL) && (p_data != NULL) && (size_byte != 0UL));
  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_RX);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  hi2c->mode = HAL_I2C_MODE_SLAVE;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_rx = (uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_size = hi2c->xfer_count;
  hi2c->xfer_isr = NULL;

  LL_I2C_AcknowledgeEnable(p_i2cx);

  /* Wait until ADDR flag is set */
  hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_ADDR, 0U, timeout_ms, tick_start);
  if (hal_status == HAL_OK)
  {
    LL_I2C_ClearFlag_ADDR(p_i2cx);

    /* Wait until DIR flag is reset receiver mode */
    hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_DIR, 1U, timeout_ms, tick_start);
    if (hal_status == HAL_OK)
    {
      while (hi2c->xfer_count > 0U)
      {
        /* Wait until RXNE flag is set */
        hal_status = I2C_WaitOnRXNEFlagUntilTimeout(hi2c, timeout_ms, tick_start);
        if (hal_status != HAL_OK)
        {
          /* Store last receive data if any */
          if (LL_I2C_IsActiveFlag_RXNE(p_i2cx) != 0U)
          {
            /* Read data from RXDR */
            *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
          }
          break;
        }

        /* Read data from RXDR */
        *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
        hi2c->p_buf_rx++;
        hi2c->xfer_count--;
        hi2c->xfer_size--;
      }

      if (hal_status == HAL_OK)
      {
        /* Wait until STOP flag is set */
        hal_status = I2C_WaitOnSTOPFlagUntilTimeout(hi2c, timeout_ms, tick_start);
        if (hal_status == HAL_OK)
        {
          LL_I2C_ClearFlag_STOP(p_i2cx);

          /* Wait until BUSY flag is reset */
          hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_BUSY, 1U, timeout_ms, tick_start);
        }
      }
    }
  }

  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->global_state = HAL_I2C_STATE_IDLE;

  return hal_status;
}

/**
  * @brief  Transmit in master mode an amount of data in non-blocking mode with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing or bus is busy
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_Transmit_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                        uint32_t size_byte)
{
  I2C_TypeDef *p_i2cx;
  uint32_t xfer_mode;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

