MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_RX);
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  hi2c->mode = HAL_I2C_MODE_SLAVE;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  LL_I2C_AcknowledgeEnable(p_i2cx);

  /* Prepare transfer parameters */
  hi2c->p_buf_rx = (uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_size = hi2c->xfer_count;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->xfer_isr = I2C_Slave_ISR_IT;

  /* Enable ERR, TC, STOP, NACK, RXI interrupt possible to enable all of these */
  /* LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE */
  /* | LL_I2C_CR1_ADDRIE | LL_I2C_CR1_RXIE | LL_I2C_CR1_TXIE */
  LL_I2C_EnableIT(p_i2cx, I2C_XFER_RX_IT_MASK | I2C_XFER_LISTEN_IT_MASK);

  return HAL_OK;
}

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/**
  * @brief  Transmit in master mode an amount of data in non-blocking mode with DMA.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Dma error
  * @retval HAL_BUSY          Concurrent process ongoing or bus is busy
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_Transmit_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                         uint32_t size_byte)
{
  I2C_TypeDef *p_i2cx;
  uint32_t xfer_mode;
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);

  if (LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
  {
    hi2c->global_state = HAL_I2C_STATE_IDLE;
    return HAL_BUSY;
  }

  hi2c->mode = HAL_I2C_MODE_MASTER;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_tx = (const uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->xfer_isr = I2C_Master_ISR_DMA;

  if (hi2c->xfer_count > MAX_NBYTE_SIZE)
  {
    hi2c->xfer_size = MAX_NBYTE_SIZE;
    xfer_mode = LL_I2C_MODE_RELOAD;
  }
  else
  {
    hi2c->xfer_size = hi2c->xfer_count;
    xfer_mode = LL_I2C_MODE_AUTOEND;
  }

  if (hi2c->xfer_size > 0U)
  {
    if (hi2c->hdma_tx != NULL)
    {
      /* Set the I2C DMA transfer complete callback */
      hi2c->hdma_tx->p_xfer_cplt_cb = I2C_DMAMasterTransmitCplt;

      /* Set the DMA error callback */
      hi2c->hdma_tx->p_xfer_error_cb = I2C_DMAError;

      /* Enable the DMA channel */
      hal_status = HAL_DMA_StartPeriphXfer_IT_Opt(hi2c->hdma_tx,
                                                  (uint32_t) p_data,
                                                  LL_I2C_DMA_GetRegAddrTx(p_i2cx),
                                                  hi2c->xfer_size, HAL_DMA_OPT_IT_NONE);
    }

    if (hal_status == HAL_OK)
    {
      /* Send slave address */
      /* Set NBYTES to write and reload if hi2c->xfer_count > MAX_NBYTE_SIZE and generate RESTART */
      I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, xfer_mode, I2C_GENERATE_START_WRITE);

      hi2c->xfer_count -= hi2c->xfer_size;

      /* Enable ERR and NACK interrupts */
      LL_I2C_EnableIT(p_i2cx, I2C_XFER_ERROR_IT_MASK);

      LL_I2C_EnableDMAReq_TX(p_i2cx);
    }
    else
    {
      hi2c->last_error_codes |= HAL_I2C_ERROR_DMA;
      hi2c->mode = HAL_I2C_MODE_NONE;
      hi2c->global_state = HAL_I2C_STATE_IDLE;
      hal_status = HAL_ERROR;
    }
  }
  else
  {
    hi2c->xfer_isr = I2C_Master_ISR_IT;

    /* Send slave address */
    /* Set NBYTES to write and generate START condition */
    I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_GENERATE_START_WRITE);

    /* Enable ERR, TC, STOP, NACK, TXI interrupt possible to enable all of these */
    /* LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE */
    /* | LL_I2C_CR1_ADDRIE | LL_I2C_CR1_RXIE | LL_I2C_CR1_TXIE */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_TX_IT_MASK);
    hal_status = HAL_OK;
  }

  return hal_status;
}

/**
  * @brief  Receive in master mode an amount of data in non-blocking mode with DMA.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Dma error
  * @retval HAL_BUSY          Concurrent process ongoing or bus is busy
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_Receive_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                        uint32_t size_byte)
{
  I2C_TypeDef *p_i2cx;
  uint32_t xfer_mode;
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

