MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_RX);

  if (LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
  {
    hi2c->global_state = HAL_I2C_STATE_IDLE;
    return HAL_BUSY;
  }

  hi2c->mode = HAL_I2C_MODE_MASTER_MEM;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_rx = (uint8_t *) p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->xfer_isr = I2C_Mem_ISR_IT;
  hi2c->dev_addr = device_addr;

  /* If memory address size is 8Bit */
  if (memory_addr_size == HAL_I2C_MEM_ADDR_8BIT)
  {
    /* Prefetch memory address */
    LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));

    /* Reset mem_addr content */
    hi2c->mem_addr = 0xFFFFFFFFU;
  }
  /* If memory address size is 16Bit */
  else
  {
    /* Prefetch memory address (MSB part, LSB is managed through interrupt) */
    LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_MSB(memory_addr));

    /* Prepare mem_addr buffer for LSB part */
    hi2c->mem_addr = I2C_MEM_ADD_LSB(memory_addr);
  }
  /* Send slave address and memory address */
  I2C_TransferConfig(p_i2cx, device_addr, (uint32_t) memory_addr_size, LL_I2C_MODE_SOFTEND, I2C_GENERATE_START_WRITE);

  /* Enable ERR, TC, STOP, NACK, TXI interrupt possible to enable all of these */
  /* LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE */
  /* | LL_I2C_CR1_ADDRIE | LL_I2C_CR1_RXIE | LL_I2C_CR1_TXIE */
  LL_I2C_EnableIT(p_i2cx, I2C_XFER_TX_IT_MASK);

  return HAL_OK;
}

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/**
  * @brief  Write an amount of data in non-blocking mode with DMA to a specific memory address.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  memory_addr Internal memory address
  * @param  memory_addr_size Size of internal memory address
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Dma error
  * @retval HAL_BUSY          Concurrent process ongoing or bus is busy
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_MemWrite_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                         hal_i2c_mem_addr_size_t memory_addr_size, const void *p_data,
                                         uint32_t size_byte)
{
  I2C_TypeDef *p_i2cx;
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL) && (p_data != NULL) && (size_byte != 0UL));
  ASSERT_DBG_PARAM(IS_I2C_MEMADD_SIZE(memory_addr_size));
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);

  if (LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
  {
    hi2c->global_state = HAL_I2C_STATE_IDLE;
    return HAL_BUSY;
  }

  hi2c->mode = HAL_I2C_MODE_MASTER_MEM;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_tx = (const uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->xfer_isr = I2C_Mem_ISR_DMA;
  hi2c->dev_addr = device_addr;

  if (hi2c->xfer_count > MAX_NBYTE_SIZE)
  {
    hi2c->xfer_size = MAX_NBYTE_SIZE;
  }
  else
  {
    hi2c->xfer_size = hi2c->xfer_count;
  }

  /* If memory address size is 8Bit */
  if (memory_addr_size == HAL_I2C_MEM_ADDR_8BIT)
  {
    /* Prefetch memory address */
    LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));

    /* Reset mem_addr content */
    hi2c->mem_addr = 0xFFFFFFFFU;
  }
  /* If memory address size is 16Bit */
  else
  {
    /* Prefetch memory address (MSB part, LSB is managed through interrupt) */
    LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_MSB(memory_addr));

    /* Prepare mem_addr buffer for LSB part */
    hi2c->mem_addr = I2C_MEM_ADD_LSB(memory_addr);
  }

  if (hi2c->hdma_tx != NULL)
  {
    /* Set the I2C DMA transfer complete callback */
    hi2c->hdma_tx->p_xfer_cplt_cb = I2C_DMAMasterTransmitCplt;

    /* Set the DMA error callback */
    hi2c->hdma_tx->p_xfer_error_cb = I2C_DMAError;

    /* Enable the DMA channel */
    hal_status = HAL_DMA_StartPeriphXfer_IT_Opt(hi2c->hdma_tx,
                                                (uint32_t)p_data,
                                                LL_I2C_DMA_GetRegAddrTx(p_i2cx),
                                                hi2c->xfer_size, HAL_DMA_OPT_IT_NONE);
  }

  if (hal_status == HAL_OK)
  {
    /* Send slave address and memory address */
    I2C_TransferConfig(p_i2cx, device_addr, (uint32_t)memory_addr_size, LL_I2C_MODE_RELOAD, I2C_GENERATE_START_WRITE);

    /* Enable ERR, TC, STOP, NACK, TXI interrupt possible to enable all of these */
    /* LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE */
    /* | LL_I2C_CR1_ADDRIE | LL_I2C_CR1_RXIE | LL_I2C_CR1_TXIE */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_TX_IT_MASK);
  }
  else
  {
    hi2c->last_error_codes |= HAL_I2C_ERROR_DMA;
    hi2c->mode = HAL_I2C_MODE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;
    hal_status = HAL_ERROR;
  }

  return hal_status;
}

/**
  * @brief  Read an amount of data in non-blocking mode with DMA from a specific memory address.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  memory_addr Internal memory address
  * @param  memory_addr_size Size of internal memory address
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be read in bytes
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Dma error
  * @retval HAL_BUSY          Concurrent process ongoing or bus is busy
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_MemRead_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                        hal_i2c_mem_addr_size_t memory_addr_size, void *p_data, uint32_t size_byte)
{
  I2C_TypeDef *p_i2cx;
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL) && (p_data != NULL) && (size_byte != 0UL));
  ASSERT_DBG_PARAM(IS_I2C_MEMADD_SIZE(memory_addr_size));
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

