MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_RX);

  if (LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
  {
    hi2c->global_state = HAL_I2C_STATE_IDLE;
    return HAL_BUSY;
  }

  hi2c->mode = HAL_I2C_MODE_MASTER_MEM;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_rx = (uint8_t *) p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->xfer_isr = I2C_Mem_ISR_DMA;
  hi2c->dev_addr = device_addr;

  if (hi2c->xfer_count > MAX_NBYTE_SIZE)
  {
    hi2c->xfer_size = MAX_NBYTE_SIZE;
  }
  else
  {
    hi2c->xfer_size = hi2c->xfer_count;
  }

  /* If memory address size is 8Bit */
  if (memory_addr_size == HAL_I2C_MEM_ADDR_8BIT)
  {
    /* Prefetch memory address */
    LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));

    /* Reset mem_addr content */
    hi2c->mem_addr = 0xFFFFFFFFU;
  }
  /* If memory address size is 16Bit */
  else
  {
    /* Prefetch memory address (MSB part, LSB is managed through interrupt) */
    LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_MSB(memory_addr));

    /* Prepare mem_addr buffer for LSB part */
    hi2c->mem_addr = I2C_MEM_ADD_LSB(memory_addr);
  }

  if (hi2c->hdma_rx != NULL)
  {
    /* Set the I2C DMA transfer complete callback */
    hi2c->hdma_rx->p_xfer_cplt_cb = I2C_DMAMasterReceiveCplt;

    /* Set the DMA error callback */
    hi2c->hdma_rx->p_xfer_error_cb = I2C_DMAError;

    /* Enable the DMA channel */
    hal_status = HAL_DMA_StartPeriphXfer_IT_Opt(hi2c->hdma_rx,
                                                LL_I2C_DMA_GetRegAddrRx(p_i2cx),
                                                (uint32_t)p_data,
                                                hi2c->xfer_size, HAL_DMA_OPT_IT_NONE);
  }

  if (hal_status == HAL_OK)
  {
    /* Send slave address and memory address */
    I2C_TransferConfig(p_i2cx, device_addr, (uint32_t)memory_addr_size, LL_I2C_MODE_SOFTEND, I2C_GENERATE_START_WRITE);

    /* Enable ERR, TC, STOP, NACK, TXI interrupt possible to enable all of these */
    /* LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE */
    /* | LL_I2C_CR1_ADDRIE | LL_I2C_CR1_RXIE | LL_I2C_CR1_TXIE */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_TX_IT_MASK);
  }
  else
  {
    hi2c->last_error_codes |= HAL_I2C_ERROR_DMA;
    hi2c->mode = HAL_I2C_MODE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;
    hal_status = HAL_ERROR;
  }

  return hal_status;
}
#endif /* USE_HAL_I2C_DMA */

/**
  * @brief  Check if target device is ready for communication.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  timeout_ms Timeout duration in millisecond
  * @note   This function is used with Memory devices
  * @retval HAL_OK            Target is ready for communication
  * @retval HAL_ERROR         Internal failure while waiting for hardware flags
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_TIMEOUT       User timeout elapsed: device not ready in time
  */
hal_status_t HAL_I2C_MASTER_PollForSlaveReady(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t timeout_ms)
{
  I2C_TypeDef *p_i2cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t tick_start;
  uint32_t tmp1;
  uint32_t tmp2;

  ASSERT_DBG_PARAM((hi2c != NULL));
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);
  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);

  while (hal_status == HAL_OK)
  {
    tick_start = HAL_GetTick();

    while (LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        hi2c->global_state = HAL_I2C_STATE_IDLE;
        return HAL_TIMEOUT;
      }
    }

    /* Generate Start */
    LL_I2C_WRITE_REG(p_i2cx, CR2, (I2C_GENERATE_START(LL_I2C_GetMasterAddressingMode(p_i2cx), device_addr)));

    /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
    /* Wait until STOPF flag is set or a NACK flag is set */

    tmp1 = LL_I2C_IsActiveFlag_STOP(p_i2cx);
    tmp2 = LL_I2C_IsActiveFlag_NACK(p_i2cx);

    while (((tmp1 == 0U) && (tmp2 == 0U)) && (hal_status == HAL_OK))
    {
      if (timeout_ms != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
        {
          /* Unable to get a response on the i2c bus */
          hi2c->global_state = HAL_I2C_STATE_IDLE;
          hal_status = HAL_TIMEOUT;
        }
      }

      tmp1 = LL_I2C_IsActiveFlag_STOP(p_i2cx);
      tmp2 = LL_I2C_IsActiveFlag_NACK(p_i2cx);
    }

    if (hal_status == HAL_OK)
    {
      /* Check if the NACKF flag has not been set */
      if (LL_I2C_IsActiveFlag_NACK(p_i2cx) == 0U)
      {
        /* Wait until STOPF flag is reset */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_STOPF, 0U, timeout_ms, tick_start) == HAL_OK)
        {
          /* A acknowledge appear during STOP Flag waiting process, this mean that device respond to its address */

          /* Clear STOP Flag */
          LL_I2C_ClearFlag_STOP(p_i2cx);
          break;
        }
      }
      else
      {
        /* A non acknowledge is detected, this mean that device not respond to its address,
        a new trial must be performed */

        /* Clear NACK Flag */
        LL_I2C_ClearFlag_NACK(p_i2cx);

        /* Wait until STOPF flag is set */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_STOPF, 0U, I2C_DEFAULT_TIMEOUT_MS, tick_start) == HAL_OK)
        {
          /* Clear STOP flag, auto generated with autoend */
          LL_I2C_ClearFlag_STOP(p_i2cx);
        }

        hi2c->mode = HAL_I2C_MODE_NONE;
        hal_status = HAL_ERROR;
      }
    }
  }

  hi2c->global_state = HAL_I2C_STATE_IDLE;

