MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  /* If no response from device */
  return hal_status;
}

/**
  * @brief  Sequential transmit in master I2C mode an amount of data in non-blocking mode with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  xfer_opt Options of transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_SEQ_Transmit_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                            uint32_t size_byte, hal_i2c_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;
  uint32_t xfer_mode;
  i2c_start_stop_mode_t xfer_request = I2C_GENERATE_START_WRITE;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */
  ASSERT_DBG_PARAM(IS_I2C_TRANSFER_OPTIONS_REQUEST(xfer_opt));
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);

  hi2c->mode = HAL_I2C_MODE_MASTER;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_tx = (const uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_opt = xfer_opt;
  hi2c->xfer_isr = I2C_Master_ISR_IT;

  /* If hi2c->xfer_count > MAX_NBYTE_SIZE, use reload mode */
  if (hi2c->xfer_count > MAX_NBYTE_SIZE)
  {
    hi2c->xfer_size = MAX_NBYTE_SIZE;
    xfer_mode = LL_I2C_MODE_RELOAD;
  }
  else
  {
    hi2c->xfer_size = hi2c->xfer_count;
    xfer_mode = (uint32_t) hi2c->xfer_opt;
  }

  /* If transfer direction not change and there is no request to start another frame,
     do not generate Restart Condition */
  /* Mean Previous state is same as current state */
  if ((hi2c->previous_state == I2C_STATE_MASTER_BUSY_TX)
      && (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(xfer_opt) == 0))
  {
    xfer_request = I2C_NO_STARTSTOP;
  }
  else
  {
    /* Convert OTHER_xxx xfer_opt if any */
    I2C_ConvertOtherXferOptions(hi2c);

    /* Update xfer_mode accordingly if no reload is necessary */
    if (hi2c->xfer_count <= MAX_NBYTE_SIZE)
    {
      xfer_mode = (uint32_t) hi2c->xfer_opt;
    }
  }

  /* Send slave address and set NBYTES to write */
  I2C_TransferConfig(p_i2cx, device_addr, hi2c->xfer_size, xfer_mode, xfer_request);

  /* Enable ERR, TC, STOP, NACK, TXI interrupt possible to enable all of these */
  /* LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE */
  /* | LL_I2C_CR1_ADDRIE | LL_I2C_CR1_RXIE | LL_I2C_CR1_TXIE */
  LL_I2C_EnableIT(p_i2cx, I2C_XFER_TX_IT_MASK);

  return HAL_OK;
}

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/**
  * @brief  Sequential transmit in master I2C mode an amount of data in non-blocking mode with DMA.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  xfer_opt Options of transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Dma error
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_MASTER_SEQ_Transmit_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                             uint32_t size_byte, hal_i2c_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;
  uint32_t xfer_mode;
  i2c_start_stop_mode_t xfer_request = I2C_GENERATE_START_WRITE;
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0UL)); /* if size_byte is equals to 0 p_data equals to NULL
                                                               is allowed */

  ASSERT_DBG_PARAM(IS_I2C_TRANSFER_OPTIONS_REQUEST(xfer_opt));
  p_i2cx = I2C_GET_INSTANCE(hi2c);
  ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                   IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

  ASSERT_DBG_STATE(hi2c->global_state, HAL_I2C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0UL)) /* if size_byte is equals to 0 p_data equals to NULL is allowed */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2c, global_state, HAL_I2C_STATE_IDLE, HAL_I2C_STATE_TX);

  hi2c->mode = HAL_I2C_MODE_MASTER;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  /* Prepare transfer parameters */
  hi2c->p_buf_tx = (const uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_opt = xfer_opt;
  hi2c->xfer_isr = I2C_Master_ISR_DMA;

  /* If hi2c->xfer_count > MAX_NBYTE_SIZE, use reload mode */
  if (hi2c->xfer_count > MAX_NBYTE_SIZE)
  {
    hi2c->xfer_size = MAX_NBYTE_SIZE;
    xfer_mode = LL_I2C_MODE_RELOAD;
  }
  else
  {
    hi2c->xfer_size = hi2c->xfer_count;
    xfer_mode = (uint32_t) hi2c->xfer_opt;
  }

  /* If transfer direction not change and there is no request to start another frame,
     do not generate Restart Condition */
  /* Mean Previous state is same as current state */
  if ((hi2c->previous_state == I2C_STATE_MASTER_BUSY_TX)
      && (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(xfer_opt) == 0))
  {
    xfer_request = I2C_NO_STARTSTOP;
  }
  else
  {
    /* Convert OTHER_xxx xfer_opt if any */
    I2C_ConvertOtherXferOptions(hi2c);

    /* Update xfer_mode accordingly if no reload is necessary */
    if (hi2c->xfer_count <= MAX_NBYTE_SIZE)
    {
      xfer_mode = (uint32_t) hi2c->xfer_opt;
    }
  }

