MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1)
  if (((uint32_t)hi2c->global_state & ((uint32_t)HAL_I2C_STATE_LISTEN | (uint32_t)HAL_I2C_STATE_RX_LISTEN \
                                       | (uint32_t)HAL_I2C_STATE_TX_LISTEN)) == 0U)
  {
    return HAL_BUSY;
  }
#endif /* USE_HAL_CHECK_PROCESS_STATE */
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Disable interrupts, to prevent preemption during treatment in case of multicall */
  I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_TX_IT);

  /* I2C cannot manage full duplex exchange so disable previous IT enabled if any */
  /* and then toggle the HAL slave RX state to TX state */
  if (hi2c->global_state == HAL_I2C_STATE_RX_LISTEN)
  {
    /* Disable associated interrupts */
    I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

    if (LL_I2C_IsEnabledDMAReq_RX(p_i2cx) != 0UL)
    {
      /* Abort DMA Xfer if any */
      if (hi2c->hdma_rx != NULL)
      {
        LL_I2C_DisableDMAReq_RX(p_i2cx);

        /* Set the I2C DMA abort callback with HAL_I2C_ErrorCallback() at end of DMA abort procedure */
        hi2c->hdma_rx->p_xfer_abort_cb = I2C_DMAAbort;

        /* Abort DMA RX */
        if (HAL_DMA_Abort_IT(hi2c->hdma_rx) != HAL_OK)
        {
          /* Call directly p_xfer_abort_cb function in case of error */
          hi2c->hdma_rx->p_xfer_abort_cb(hi2c->hdma_rx);
        }
      }
    }
  }
  else if (hi2c->global_state == HAL_I2C_STATE_TX_LISTEN)
  {
    if (LL_I2C_IsEnabledDMAReq_TX(p_i2cx) != 0UL)
    {
      LL_I2C_DisableDMAReq_TX(p_i2cx);

      /* Abort DMA Xfer if any */
      if (hi2c->hdma_tx != NULL)
      {
        /* Set the I2C DMA abort callback with HAL_I2C_ErrorCallback() at end of DMA abort procedure */
        hi2c->hdma_tx->p_xfer_abort_cb = I2C_DMAAbort;

        /* Abort DMA TX */
        if (HAL_DMA_Abort_IT(hi2c->hdma_tx) != HAL_OK)
        {
          /* Call directly p_xfer_abort_cb function in case of error */
          hi2c->hdma_tx->p_xfer_abort_cb(hi2c->hdma_tx);
        }
      }
    }
  }
  else
  {
    /* Nothing to do */
  }

  hi2c->global_state = HAL_I2C_STATE_TX_LISTEN;
  hi2c->mode = HAL_I2C_MODE_SLAVE;
  hi2c->last_error_codes = HAL_I2C_ERROR_NONE;

  LL_I2C_AcknowledgeEnable(p_i2cx);

  /* Prepare transfer parameters */
  hi2c->p_buf_tx = (const uint8_t *)p_data;
  hi2c->xfer_count = size_byte;
  hi2c->xfer_size = hi2c->xfer_count;
  hi2c->xfer_opt = xfer_opt;
  hi2c->xfer_isr = I2C_Slave_ISR_DMA;

  if (hi2c->hdma_tx != NULL)
  {
    /* Set the I2C DMA transfer complete callback */
    hi2c->hdma_tx->p_xfer_cplt_cb = I2C_DMASlaveTransmitCplt;

    /* Set the DMA error callback */
    hi2c->hdma_tx->p_xfer_error_cb = I2C_DMAError;

    /* Enable the DMA channel */
    hal_status = HAL_DMA_StartPeriphXfer_IT_Opt(hi2c->hdma_tx,
                                                (uint32_t)p_data,
                                                LL_I2C_DMA_GetRegAddrTx(p_i2cx),
                                                hi2c->xfer_size, HAL_DMA_OPT_IT_NONE);
  }

  if (hal_status == HAL_OK)
  {
    hi2c->xfer_count -= hi2c->xfer_size;
    hi2c->xfer_size = 0;

    tmp = LL_I2C_IsActiveFlag_ADDR(p_i2cx);
    if ((LL_I2C_GetTransferDirection(p_i2cx) == LL_I2C_DIRECTION_READ) && (tmp != 0U))
    {
      /* Clear ADDR flag after prepare the transfer parameters */
      /* This action generates an acknowledge to the master */
      LL_I2C_ClearFlag_ADDR(p_i2cx);
    }

    LL_I2C_EnableDMAReq_TX(p_i2cx);

    /* Enable ERR, STOP, NACK, ADDR interrupts */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_LISTEN_IT_MASK);
  }
  else
  {
    hi2c->last_error_codes |= HAL_I2C_ERROR_DMA;
    hi2c->mode = HAL_I2C_MODE_NONE;
    hi2c->global_state = HAL_I2C_STATE_LISTEN;
    hal_status = HAL_ERROR;
  }


  return hal_status;
}
#endif /* USE_HAL_I2C_DMA */

/**
  * @brief  Sequential receive in slave/device I2C mode an amount of data in non-blocking mode with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to be sent in bytes
  * @param  xfer_opt Options of transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_I2C_SLAVE_SEQ_Receive_IT(hal_i2c_handle_t *hi2c, void *p_data, uint32_t size_byte,
                                          hal_i2c_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;
  /* Declaration of tmp to prevent undefined behavior of volatile usage */
  uint32_t tmp;

  ASSERT_DBG_PARAM((hi2c != NULL) && (p_data != NULL) && (size_byte != 0UL));
  ASSERT_DBG_PARAM(IS_I2C_TRANSFER_OPTIONS_REQUEST(xfer_opt));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_LISTEN      \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1)
  if (((uint32_t)hi2c->global_state & ((uint32_t)HAL_I2C_STATE_LISTEN | (uint32_t)HAL_I2C_STATE_RX_LISTEN \
                                       | (uint32_t)HAL_I2C_STATE_TX_LISTEN)) == 0U)
  {
    return HAL_BUSY;
  }
#endif /* USE_HAL_CHECK_PROCESS_STATE */
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Disable interrupts, to prevent preemption during treatment in case of multicall */
  I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_RX_IT);

  /* I2C cannot manage full duplex exchange so disable previous IT enabled if any */
  /* and then toggle the HAL slave TX state to RX state */
  if (hi2c->global_state == HAL_I2C_STATE_TX_LISTEN)
  {
    /* Disable associated interrupts */
    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
    if (LL_I2C_IsEnabledDMAReq_TX(p_i2cx) != 0UL)
    {
      LL_I2C_DisableDMAReq_TX(p_i2cx);

      /* Abort DMA Xfer if any */
      if (hi2c->hdma_tx != NULL)
      {
        /* Set the I2C DMA abort callback with HAL_I2C_ErrorCallback() at end of DMA abort procedure */
        hi2c->hdma_tx->p_xfer_abort_cb = I2C_DMAAbort;

