MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  hi2c->previous_state = I2C_STATE_NONE;
  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->xfer_isr = NULL;

  /* Disable the Address Match interrupt */
  I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT);

  return HAL_OK;
}

/**
  * @brief  Abort a master or memory I2C IT or DMA process communication with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Mode is not master
  * @retval HAL_BUSY          No process ongoing
  */
hal_status_t HAL_I2C_MASTER_Abort_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));

  hal_i2c_mode_t tmp_mode = hi2c->mode;

  if ((tmp_mode == HAL_I2C_MODE_MASTER) || (tmp_mode == HAL_I2C_MODE_MASTER_MEM))
  {
    p_i2cx = I2C_GET_INSTANCE(hi2c);
    ASSERT_DBG_PARAM((LL_I2C_GetMasterAddressingMode(p_i2cx) == LL_I2C_ADDRESSING_MODE_7BIT) ?
                     IS_I2C_OWN_ADDRESS_7BIT(device_addr) : IS_I2C_OWN_ADDRESS_10BIT(device_addr));

    ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_TX          \
                                          | HAL_I2C_STATE_RX        \
                                          | HAL_I2C_STATE_LISTEN    \
                                          | HAL_I2C_STATE_RX_LISTEN \
                                          | HAL_I2C_STATE_TX_LISTEN));

    /* Disable interrupts and store previous state */
    if (hi2c->global_state == HAL_I2C_STATE_TX)
    {
      I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);
      hi2c->previous_state = I2C_STATE_MASTER_BUSY_TX;
    }
    else if (hi2c->global_state == HAL_I2C_STATE_RX)
    {
      I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);
      hi2c->previous_state = I2C_STATE_MASTER_BUSY_RX;
    }
    else
    {
      /* Do nothing */
    }

    hi2c->global_state = HAL_I2C_STATE_ABORT;

    /* Set NBYTES to 1 to generate a dummy read on I2C peripheral */
    /* Set AUTOEND mode, this generates a NACK then STOP condition to abort the current transfer */
    I2C_TransferConfig(p_i2cx, device_addr, 1, LL_I2C_MODE_AUTOEND, I2C_GENERATE_STOP);

    LL_I2C_EnableIT(p_i2cx, I2C_XFER_CPLT_IT_MASK);

    return HAL_OK;
  }
  else
  {
    /* Wrong usage of abort function */
    /* This function must be used only in case of abort monitored by master device */
    return HAL_ERROR;
  }
}

/**
  * @brief  Abort a slave I2C IT or DMA process communication with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_I2C_SLAVE_Abort_IT(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  p_i2cx = I2C_GET_INSTANCE(hi2c);
  LL_I2C_AcknowledgeNextData(p_i2cx, LL_I2C_NACK);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup I2C_Exported_Functions_Group4
  * @{
A set of function to handle the I2C interruptions :
  - I2C Event IRQ Handler : HAL_I2C_EV_IRQHandler()
  - I2C Error IRQ Handler : HAL_I2C_ERR_IRQHandler()

  Depending on the process function one's use, different callback might be triggered:

| Process API \n \ \n Callbacks    |    HAL_I2C_MASTER_Transmit_IT   |   HAL_I2C_MASTER_Receive_IT    |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_I2C_MASTER_TxCpltCallback    |                x                |                                |
| HAL_I2C_MASTER_RxCpltCallback    |                                 |                x               |
| HAL_I2C_ErrorCallback            |                x                |                x               |
| HAL_I2C_AbortCpltCallback*       |                x                |                x               |

| Process API \n \ \n Callbacks    |  HAL_I2C_MASTER_SEQ_Transmit_IT | HAL_I2C_MASTER_SEQ_Receive_IT  |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_I2C_MASTER_TxCpltCallback    |                x                |                                |
| HAL_I2C_MASTER_RxCpltCallback    |                                 |                x               |
| HAL_I2C_ErrorCallback            |                x                |                x               |
| HAL_I2C_AbortCpltCallback*       |                x                |                x               |

| Process API \n \ \n Callbacks    |   HAL_I2C_MASTER_Transmit_DMA   |   HAL_I2C_MASTER_Receive_DMA   |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_I2C_MASTER_TxCpltCallback    |                x                |                                |
| HAL_I2C_MASTER_RxCpltCallback    |                                 |                x               |
| HAL_I2C_ErrorCallback            |                x                |                x               |
| HAL_I2C_AbortCpltCallback*       |                x                |                x               |

| Process API \n \ \n Callbacks    | HAL_I2C_MASTER_SEQ_Transmit_DMA | HAL_I2C_MASTER_SEQ_Receive_DMA |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_I2C_MASTER_TxCpltCallback    |                x                |                                |
| HAL_I2C_MASTER_RxCpltCallback    |                                 |                x               |
| HAL_I2C_ErrorCallback            |                x                |                x               |
| HAL_I2C_AbortCpltCallback*       |                x                |                x               |
@note * HAL_I2C_AbortCpltCallback is called by the ISR when the abort is requested by the slave (using NACK) or
        the master (by generating STOP)

| Process API \n \ \n Callbacks    |  HAL_I2C_MASTER_MemWrite_IT  |  HAL_I2C_MASTER_MemRead_IT  |
|----------------------------------|:----------------------------:|:---------------------------:|
| HAL_I2C_MASTER_MemTxCpltCallback |              x               |                             |
| HAL_I2C_MASTER_MemRxCpltCallback |                              |              x              |

| Process API \n \ \n Callbacks    |  HAL_I2C_MASTER_MemWrite_DMA  |  HAL_I2C_MASTER_MemRead_DMA  |
|----------------------------------|:-----------------------------:|:----------------------------:|
| HAL_I2C_MASTER_MemTxCpltCallback |               x               |                              |
| HAL_I2C_MASTER_MemRxCpltCallback |                               |               x              |

| Process API \n \ \n Callbacks    |    HAL_I2C_SLAVE_Transmit_IT    |    HAL_I2C_SLAVE_Receive_IT    |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_I2C_SLAVE_TxCpltCallback     |                x                |                                |
| HAL_I2C_SLAVE_RxCpltCallback     |                                 |                  x             |
| HAL_I2C_SLAVE_ListenCpltCallback |                x                |                  x             |
| HAL_I2C_ErrorCallback            |                x                |                  x             |

| Process API \n \ \n Callbacks    |  HAL_I2C_SLAVE_SEQ_Transmit_IT  |  HAL_I2C_SLAVE_SEQ_Receive_IT  |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_I2C_SLAVE_TxCpltCallback     |                x                |                                |
| HAL_I2C_SLAVE_RxCpltCallback     |                                 |                  x             |
| HAL_I2C_SLAVE_ListenCpltCallback |                x                |                  x             |
| HAL_I2C_ErrorCallback            |                x                |                  x             |

| Process API \n \ \n Callbacks    |   HAL_I2C_SLAVE_Transmit_DMA    |   HAL_I2C_SLAVE_Receive_DMA   |
|----------------------------------|:-------------------------------:|:-----------------------------:|
| HAL_I2C_SLAVE_TxCpltCallback     |                x                |                               |
| HAL_I2C_SLAVE_RxCpltCallback     |                                 |                x              |
| HAL_I2C_SLAVE_ListenCpltCallback |                x                |                x              |
| HAL_I2C_ErrorCallback            |                x                |                x              |

| Process API \n \ \n Callbacks    |  HAL_I2C_SLAVE_SEQ_Transmit_DMA  |  HAL_I2C_SLAVE_SEQ_Receive_DMA  |
|----------------------------------|:--------------------------------:|:-------------------------------:|
| HAL_I2C_SLAVE_TxCpltCallback     |                 x                |                                 |
| HAL_I2C_SLAVE_RxCpltCallback     |                                  |                  x              |
| HAL_I2C_SLAVE_ListenCpltCallback |                 x                |                  x              |
| HAL_I2C_ErrorCallback            |                 x                |                  x              |
@note HAL_I2C_SLAVE_EnableListen_IT must be called before HAL_I2C_SLAVE_SEQ_Transmit_IT and
      HAL_I2C_SLAVE_SEQ_Receive_IT

| Process API \n \ \n Callbacks      |  HAL_I2C_SLAVE_EnableListen_IT  |
|------------------------------------|:-------------------------------:|
| HAL_I2C_SLAVE_AddrCallback         |                x                |

| Process API \n \ \n Callbacks    |    HAL_I2C_MASTER_Abort_IT    |     HAL_I2C_SLAVE_Abort_IT    |
|----------------------------------|:-----------------------------:|:-----------------------------:|
| HAL_I2C_AbortCpltCallback        |               x               |               x               |

  */

/**
  * @brief  This function handles I2C event interrupt request.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  */
void HAL_I2C_EV_IRQHandler(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Get current IT flags and IT sources value */
  uint32_t it_flags   = LL_I2C_READ_REG(p_i2cx, ISR) & I2C_FLAG_MASK;
  uint32_t it_sources = LL_I2C_READ_REG(p_i2cx, CR1);

  /* I2C events treatment -------------------------------------*/
  if (hi2c->xfer_isr != NULL)
  {
    hi2c->xfer_isr(hi2c, it_flags, it_sources);
  }
}

/**
  * @brief  This function handles I2C error interrupt request.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  */
void HAL_I2C_ERR_IRQHandler(hal_i2c_handle_t *hi2c)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hi2c != NULL));
  p_i2cx = I2C_GET_INSTANCE(hi2c);

  uint32_t it_flags = LL_I2C_READ_REG(p_i2cx, ISR) & I2C_FLAG_MASK;
  uint32_t it_sources = LL_I2C_READ_REG(p_i2cx, CR1);
  uint32_t tmp_error = HAL_I2C_ERROR_NONE;

  /* I2C bus error interrupt occurred ------------------------------------*/
  if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_BERR) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_ERRIE) != 0U))
  {
    tmp_error |= HAL_I2C_ERROR_BERR;
    LL_I2C_ClearFlag_BERR(p_i2cx);
  }

