MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  /* I2C over-run/under-run interrupt occurred ----------------------------------------*/
  if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_OVR) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_ERRIE) != 0U))
  {
    tmp_error |= HAL_I2C_ERROR_OVR;
    LL_I2C_ClearFlag_OVR(p_i2cx);
  }

  /* I2C arbitration loss error interrupt occurred -------------------------------------*/
  if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_ARLO) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_ERRIE) != 0U))
  {
    tmp_error |= HAL_I2C_ERROR_ARLO;
    LL_I2C_ClearFlag_ARLO(p_i2cx);
  }

  /* Call the error callback in case of error detected */
  if (tmp_error != HAL_I2C_ERROR_NONE)
  {
    I2C_ITError(hi2c, tmp_error);
  }
}

/**
  * @}
  */

/** @addtogroup I2C_Exported_Functions_Group5
  * @{
A set of Weak functions (or default Callbacks functions if USE_HAL_I2C_REGISTER_CALLBACKS is set to 1) which are used
to asynchronously informed the application in non blocking modes (Interrupt and DMA) :
 - HAL_I2C_MASTER_TxCpltCallback()     : Master Tx transfer completed callback
 - HAL_I2C_MASTER_RxCpltCallback()     : Master Rx transfer completed callback
 - HAL_I2C_SLAVE_TxCpltCallback()      : Slave Tx transfer completed callback
 - HAL_I2C_SLAVE_RxCpltCallback()      : Slave Rx transfer completed callback
 - HAL_I2C_MASTER_MemTxCpltCallback()  : Memory Tx transfer completed callback
 - HAL_I2C_MASTER_MemRxCpltCallback()  : Memory Rx transfer completed callback
 - HAL_I2C_SLAVE_AddrCallback()        : Slave Address Match callback
 - HAL_I2C_SLAVE_ListenCpltCallback()  : Listen Complete callback
 - HAL_I2C_ErrorCallback()             : I2C error callback
 - HAL_I2C_AbortCpltCallback()         : I2C abort complete callback
 */

/**
  * @brief  Master Tx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_MASTER_TxCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  Master Rx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_MASTER_RxCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  Slave Tx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_SLAVE_TxCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  Slave Rx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_SLAVE_RxCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  Slave Address Match callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  xfer_direction Master request transfer Direction (Write/Read)
  * @param  addr_match_code Address Match Code
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_SLAVE_AddrCallback(hal_i2c_handle_t *hi2c,
                                       hal_i2c_slave_xfer_direction_t xfer_direction,
                                       uint32_t addr_match_code)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
  STM32_UNUSED(xfer_direction);
  STM32_UNUSED(addr_match_code);
}

/**
  * @brief  Listen Complete callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_SLAVE_ListenCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  Memory Tx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_MASTER_MemTxCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  Memory Rx transfer completed callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_MASTER_MemRxCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  I2C error callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_ErrorCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @brief  I2C abort complete callback.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I2C_AbortCpltCallback(hal_i2c_handle_t *hi2c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2c);
}

/**
  * @}
  */

/** @addtogroup I2C_Exported_Functions_Group6
  * @{
A set of functions allowing to retrieve peripheral state, mode and last process errors.
 - HAL_I2C_GetState() : Return the I2C handle state
 - HAL_I2C_GetMode() : Returns the functional I2C mode. master, slave, memory or no mode.
 - HAL_I2C_GetLastErrorCodes() : Returns errors limited to the last process.
 - HAL_I2C_GetClockFreq() : Retrieve the HAL I2C instance kernel clock frequency.
  */

/**
  * @brief  Return the I2C handle state.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval hal_i2c_state_t HAL I2C state
  */
hal_i2c_state_t HAL_I2C_GetState(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_INIT        \
                                        | HAL_I2C_STATE_IDLE      \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

