MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  return hi2c->global_state;
}

/**
  * @brief  Returns the functional I2C mode. master, slave, memory or no mode.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval hal_i2c_mode_t HAL I2C mode
  */
hal_i2c_mode_t HAL_I2C_GetMode(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_TX          \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  return hi2c->mode;
}

#if defined (USE_HAL_I2C_GET_LAST_ERRORS) && (USE_HAL_I2C_GET_LAST_ERRORS == 1)
/**
  * @brief  Returns errors limited to the last process.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval uint32_t last error code. It can be HAL_I2C_ERROR_NONE or a combinaison of the following values:
  *         HAL_I2C_ERROR_BERR
  *         HAL_I2C_ERROR_ARLO
  *         HAL_I2C_ERROR_AF
  *         HAL_I2C_ERROR_OVR
  *         HAL_I2C_ERROR_DMA
  *         HAL_I2C_ERROR_SIZE
  */
uint32_t HAL_I2C_GetLastErrorCodes(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_IDLE        \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  return hi2c->last_error_codes;
}
#endif /* USE_HAL_I2C_GET_LAST_ERRORS */

/** @brief  Return the peripheral clock frequency for I2C.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @retval uint32_t Frequency in Hz.
  *                  0 if the source clock of the I2C is not configured or not ready.
  */
uint32_t HAL_I2C_GetClockFreq(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_INIT        \
                                        | HAL_I2C_STATE_IDLE      \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  return HAL_RCC_I2C_GetKernelClkFreq(I2C_GET_INSTANCE(hi2c));
}

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup I2C_Exported_Functions_Group7
  * @{
A set of functions allowing to Acquire/Release the bus based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
 - HAL_I2C_AcquireBus() Acquire the I2C bus.
 - HAL_I2C_ReleaseBus() Release the I2C bus.
  */

/**
  * @brief  Acquire the I2C bus thanks to the the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  timeout_ms Timeout duration in millisecond.
  * @note   The HAL_I2C_AcquireBus must be called from thread mode only (not from handler mode i.e from ISR).
  * @retval HAL_OK    Operation completed successfully
  * @retval HAL_ERROR Operation completed with error
  */
hal_status_t HAL_I2C_AcquireBus(hal_i2c_handle_t *hi2c, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_INIT        \
                                        | HAL_I2C_STATE_IDLE      \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  if (HAL_OS_SemaphoreTake(&hi2c->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the I2C bus thanks to the the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @note   The HAL_I2C_ReleaseBus can be called from thread mode or from handler mode i.e from ISR.
  * @retval HAL_OK    Operation completed successfully
  * @retval HAL_ERROR Operation completed with error
  */
hal_status_t HAL_I2C_ReleaseBus(hal_i2c_handle_t *hi2c)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hi2c != NULL));
  ASSERT_DBG_STATE(hi2c->global_state, (HAL_I2C_STATE_INIT        \
                                        | HAL_I2C_STATE_IDLE      \
                                        | HAL_I2C_STATE_TX        \
                                        | HAL_I2C_STATE_RX        \
                                        | HAL_I2C_STATE_LISTEN    \
                                        | HAL_I2C_STATE_RX_LISTEN \
                                        | HAL_I2C_STATE_TX_LISTEN \
                                        | HAL_I2C_STATE_ABORT));

  if (HAL_OS_SemaphoreRelease(&hi2c->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_I2C_USER_DATA) && (USE_HAL_I2C_USER_DATA == 1)
/** @addtogroup I2C_Exported_Functions_Group8
  * @{
A set of functions allowing to manage a user data pointer stored to the I2C handle:
 - HAL_I2C_SetUserData() Set the user data into the handle
 - HAL_I2C_GetUserData() Get the user data from the handle
  */

/**
  * @brief Set the user data pointer into the handle.
  * @param hi2c Pointer to a hal_i2c_handle_t
  * @param p_user_data Pointer to the user data.
  */
void HAL_I2C_SetUserData(hal_i2c_handle_t *hi2c, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hi2c != NULL);

  hi2c->p_user_data = p_user_data;
}

/**
  * @brief Get the user data pointer from the handle.
  * @param hi2c Pointer to a hal_i2c_handle_t
  * @retval void* Pointer to the user data.
  */
const void *HAL_I2C_GetUserData(const hal_i2c_handle_t *hi2c)
{
  ASSERT_DBG_PARAM(hi2c != NULL);

