MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  return (hi2c->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_I2C_USER_DATA */

/**
  * @}
  */

/** @addtogroup I2C_Private_Functions
  * @{
  */

/**
  * @brief  Interrupt sub-routine which handle the interrupt flags master mode with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  it_flags Interrupt flags to handle
  * @param  it_sources Interrupt sources enabled
  * @retval HAL_OK Operation completed successfully
  */
static hal_status_t I2C_Master_ISR_IT(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t dev_addr;
  uint32_t tmp_it_flags = it_flags;

  if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_NACKF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_NACKIE) != 0U))
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    /* No need to generate STOP, it is automatically done */
    /* Error callback is send during stop flag treatment */
    hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

    I2C_Flush_TXDR(p_i2cx);
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_RXNE) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_RXIE) != 0U))
  {
    /* Remove RXNE flag on temporary variable as read done */
    tmp_it_flags &= ~LL_I2C_ISR_RXNE;

    /* Read data from RXDR */
    *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
    hi2c->p_buf_rx++;
    hi2c->xfer_size--;
    hi2c->xfer_count--;
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TXIS) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TXIE) != 0U))
  {
    /* Write data to TXDR */
    /* Write data to TXDR */
    LL_I2C_TransmitData8(p_i2cx, *hi2c->p_buf_tx);
    hi2c->p_buf_tx++;
    hi2c->xfer_size--;
    hi2c->xfer_count--;
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TCR) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    if ((hi2c->xfer_count != 0U) && (hi2c->xfer_size == 0U))
    {
      dev_addr = LL_I2C_GetSlaveAddr(p_i2cx);

      if (hi2c->xfer_count > MAX_NBYTE_SIZE)
      {
        hi2c->xfer_size = MAX_NBYTE_SIZE;
        I2C_TransferConfig(p_i2cx, dev_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_NO_STARTSTOP);
      }
      else
      {
        hi2c->xfer_size = hi2c->xfer_count;
        if (hi2c->xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION)
        {
          I2C_TransferConfig(p_i2cx, dev_addr, hi2c->xfer_size, (uint32_t)hi2c->xfer_opt, I2C_NO_STARTSTOP);
        }
        else
        {
          I2C_TransferConfig(p_i2cx, dev_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_NO_STARTSTOP);
        }
      }
    }
    else
    {
      /* Call TxCpltCallback() if auto end mode is set */
      if (LL_I2C_IsEnabledAutoEndMode(p_i2cx) == 0U)
      {
        /* Call I2C master Sequential complete process */
        I2C_ITMasterSeqCplt(hi2c);
      }
      else
      {
        /* Wrong size status regarding TCR flag event */
        /* Call the corresponding callback to inform upper layer of end of transfer */
        I2C_ITError(hi2c, HAL_I2C_ERROR_SIZE);
      }
    }
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TC) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    if (hi2c->xfer_count == 0U)
    {
      if (LL_I2C_IsEnabledAutoEndMode(p_i2cx) == 0U)
      {
        /* Generate a stop condition in case of no transfer option */
        if (hi2c->xfer_opt == (hal_i2c_xfer_opt_t) XFER_NO_OPTION)
        {
          LL_I2C_GenerateStopCondition(p_i2cx);
        }
        else
        {
          /* Call I2C master sequential complete process */
          I2C_ITMasterSeqCplt(hi2c);
        }
      }
    }
    else
    {
      /* Wrong size status regarding TC flag event */
      /* Call the corresponding callback to inform upper layer of end of transfer */
      I2C_ITError(hi2c, HAL_I2C_ERROR_SIZE);
    }
  }
  else
  {
    /* Nothing to do */
  }

  if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_STOPF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    /* Call I2C master complete process */
    I2C_ITMasterCplt(hi2c, tmp_it_flags);
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt sub-routine which handle the interrupt flags memory mode with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t that contains the configuration information for the specified I2C.
  * @param  it_flags Interrupt flags to handle
  * @param  it_sources Interrupt sources enabled
  * @retval HAL_OK Operation completed successfully
  */
static hal_status_t I2C_Mem_ISR_IT(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  i2c_start_stop_mode_t direction = I2C_GENERATE_START_WRITE;
  uint32_t tmp_it_flags = it_flags;

  if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_NACKF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_NACKIE) != 0U))
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    /* No need to generate STOP, it is automatically done */
    /* Error callback is sent during stop flag treatment */
    hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

    I2C_Flush_TXDR(p_i2cx);
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_RXNE) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_RXIE) != 0U))
  {
    /* Remove RXNE flag on temporary variable as read done */
    tmp_it_flags &= ~LL_I2C_ISR_RXNE;

    /* Read data from RXDR */
    *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
    hi2c->p_buf_rx++;
    hi2c->xfer_size--;
    hi2c->xfer_count--;
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TXIS) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TXIE) != 0U))
  {
    if (hi2c->mem_addr == 0xFFFFFFFFU)
    {
      /* Write data to TXDR */
      LL_I2C_TransmitData8(p_i2cx, *hi2c->p_buf_tx);
      hi2c->p_buf_tx++;
      hi2c->xfer_size--;
      hi2c->xfer_count--;
    }
    else
    {
      /* Write LSB part of Memory Address */
      LL_I2C_TransmitData8(p_i2cx, (uint8_t) hi2c->mem_addr);

      /* Reset mem_addr content */
      hi2c->mem_addr = 0xFFFFFFFFU;
    }
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TCR) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    if ((hi2c->xfer_count != 0U) && (hi2c->xfer_size == 0U))
    {
      if (hi2c->xfer_count > MAX_NBYTE_SIZE)
      {
        hi2c->xfer_size = MAX_NBYTE_SIZE;
        I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_NO_STARTSTOP);
      }
      else
      {
        hi2c->xfer_size = hi2c->xfer_count;
        I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_NO_STARTSTOP);
      }
    }
    else
    {
      /* Wrong size status regarding TCR flag event */
      /* Call the corresponding callback to inform upper layer of end of transfer */
      I2C_ITError(hi2c, HAL_I2C_ERROR_SIZE);
    }
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TC) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    /* Disable interrupt related to address step */
    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

    /* Enable ERR, TC, STOP, NACK and RXI interrupts */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_RX_IT_MASK);

