MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
    if (hi2c->global_state == HAL_I2C_STATE_RX)
    {
      direction = I2C_GENERATE_START_READ;
    }

    if (hi2c->xfer_count > MAX_NBYTE_SIZE)
    {
      hi2c->xfer_size = MAX_NBYTE_SIZE;

      /* Set NBYTES to write and reload if hi2c->xfer_count > MAX_NBYTE_SIZE and generate RESTART */
      I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, direction);
    }
    else
    {
      hi2c->xfer_size = hi2c->xfer_count;

      /* Set NBYTES to write and generate RESTART */
      I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, direction);
    }
  }
  else
  {
    /* Nothing to do */
  }

  if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_STOPF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    /* Call I2C master complete process */
    I2C_ITMasterCplt(hi2c, tmp_it_flags);
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt sub-routine which handle the interrupt flags slave mode with interrupt.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  it_flags Interrupt flags to handle
  * @param  it_sources Interrupt sources enabled
  * @retval HAL_OK Operation completed successfully
  */
static hal_status_t I2C_Slave_ISR_IT(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  hal_i2c_xfer_opt_t xfer_opt = hi2c->xfer_opt;
  uint32_t tmp_it_flags = it_flags;

  /* Check if STOPF is set */
  if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_STOPF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    /* Call I2C slave complete process */
    I2C_ITSlaveCplt(hi2c, tmp_it_flags);
  }

  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_NACKF) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_NACKIE) != 0U))
  {
    /* Check that I2C transfer finished */
    /* if yes, normal use case, a NACK is sent by the MASTER when transfer is finished */
    /* Mean xfer_count == 0 */
    /* So clear flag NACKF only */
    if (hi2c->xfer_count == 0U)
    {
      if ((hi2c->global_state == HAL_I2C_STATE_LISTEN) && (xfer_opt == HAL_I2C_XFER_FIRST_AND_LAST_FRAME))
        /* Same action must be done for (xfer_opt == HAL_I2C_XFER_LAST_FRAME) which removed for
           Warning[Pa134]: left and right operands are identical */
      {
        /* Call I2C Listen complete process */
        I2C_ITListenCplt(hi2c, tmp_it_flags);
      }
      else if ((hi2c->global_state == HAL_I2C_STATE_TX_LISTEN) && (xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION))
      {
        LL_I2C_ClearFlag_NACK(p_i2cx);

        I2C_Flush_TXDR(p_i2cx);

        /* Last byte is transmitted */
        /* Call I2C slave sequential complete process */
        I2C_ITSlaveSeqCplt(hi2c);
      }
      else
      {
        LL_I2C_ClearFlag_NACK(p_i2cx);
      }
    }
    else
    {
      /* if no, error use case, a Non-Acknowledge of last Data is generated by the MASTER */
      LL_I2C_ClearFlag_NACK(p_i2cx);

      /* Set error_code corresponding to a Non-Acknowledge */
      hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

      if ((xfer_opt == HAL_I2C_XFER_FIRST_FRAME) || (xfer_opt == HAL_I2C_XFER_NEXT_FRAME))
      {
        /* Call the corresponding callback to inform upper layer of end of transfer */
        I2C_ITError(hi2c, hi2c->last_error_codes);
      }
    }
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_RXNE) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_RXIE) != 0U))
  {
    if (hi2c->xfer_count > 0U)
    {
      /* Read data from RXDR */
      *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
      hi2c->p_buf_rx++;
      hi2c->xfer_size--;
      hi2c->xfer_count--;
    }

    if ((hi2c->xfer_count == 0U)
        && (xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION))
    {
      /* Call I2C slave sequential complete process */
      I2C_ITSlaveSeqCplt(hi2c);
    }
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_ADDR) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_ADDRIE) != 0U))
  {
    I2C_ITAddrCplt(hi2c, tmp_it_flags);
  }
  else if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_TXIS) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TXIE) != 0U))
  {
    /* Write data to TXDR only if xfer_count not reach "0" */
    /* A TXIS flag can be set, during STOP treatment      */
    /* Check if all Data have already been sent */
    /* If it is the case, this last write in TXDR is not sent, correspond to a dummy TXIS event */
    if (hi2c->xfer_count > 0U)
    {
      /* Write data to TXDR */
      LL_I2C_TransmitData8(p_i2cx, *hi2c->p_buf_tx);
      hi2c->p_buf_tx++;
      hi2c->xfer_count--;
      hi2c->xfer_size--;
    }
    else
    {
      if ((xfer_opt == HAL_I2C_XFER_NEXT_FRAME) || (xfer_opt == HAL_I2C_XFER_FIRST_FRAME))
      {
        /* Last byte is transmitted */
        /* Call I2C slave sequential complete process */
        I2C_ITSlaveSeqCplt(hi2c);
      }
    }
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/**
  * @brief  Interrupt sub-routine which handle the interrupt flags master mode with DMA.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  it_flags Interrupt flags to handle
  * @param  it_sources Interrupt sources enabled
  * @retval HAL_OK Operation completed successfully
  */
static hal_status_t I2C_Master_ISR_DMA(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t dev_addr;
  uint32_t xfer_mode;

  if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_NACKF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_NACKIE) != 0U))
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

    /* No need to generate STOP, it is automatically done */
    /* But enable STOP interrupt, to treat it */
    /* Error callback is sent during stop flag treatment */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_CPLT_IT_DMA_MASK);

