MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
    I2C_Flush_TXDR(p_i2cx);
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_TCR) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    /* Disable transfer complete interrupt */
    LL_I2C_DisableIT(p_i2cx, LL_I2C_CR1_TCIE);

    if (hi2c->xfer_count != 0U)
    {
      /* Recover slave address */
      dev_addr = LL_I2C_GetSlaveAddr(p_i2cx);

      /* Prepare the new xfer_size to transfer */
      if (hi2c->xfer_count > MAX_NBYTE_SIZE)
      {
        hi2c->xfer_size = MAX_NBYTE_SIZE;
        xfer_mode = LL_I2C_MODE_RELOAD;
      }
      else
      {
        hi2c->xfer_size = hi2c->xfer_count;
        if (hi2c->xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION)
        {
          xfer_mode = (uint32_t) hi2c->xfer_opt;
        }
        else
        {
          xfer_mode = LL_I2C_MODE_AUTOEND;
        }
      }

      /* Set the new xfer_size in Nbytes register */
      I2C_TransferConfig(p_i2cx, dev_addr, hi2c->xfer_size, xfer_mode, I2C_NO_STARTSTOP);

      hi2c->xfer_count -= hi2c->xfer_size;

      if (hi2c->global_state == HAL_I2C_STATE_RX)
      {
        LL_I2C_EnableDMAReq_RX(p_i2cx);
      }
      else
      {
        LL_I2C_EnableDMAReq_TX(p_i2cx);
      }
    }
    else
    {
      /* Call TxCpltCallback() if auto end mode is set */
      if (LL_I2C_IsEnabledAutoEndMode(p_i2cx) == 0U)
      {
        /* Call I2C master Sequential complete process */
        I2C_ITMasterSeqCplt(hi2c);
      }
      else
      {
        /* Wrong size status regarding TCR flag event */
        /* Call the corresponding callback to inform upper layer of end of transfer */
        I2C_ITError(hi2c, HAL_I2C_ERROR_SIZE);
      }
    }
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_TC) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    if (hi2c->xfer_count == 0U)
    {
      if (LL_I2C_IsEnabledAutoEndMode(p_i2cx) == 0U)
      {
        /* Generate a stop condition in case of no transfer option */
        if (hi2c->xfer_opt == (hal_i2c_xfer_opt_t) XFER_NO_OPTION)
        {
          LL_I2C_GenerateStopCondition(p_i2cx);
        }
        else
        {
          /* Call I2C master Sequential complete process */
          I2C_ITMasterSeqCplt(hi2c);
        }
      }
    }
    else
    {
      /* Wrong size status regarding TC flag event */
      /* Call the corresponding callback to inform upper layer of end of transfer */
      I2C_ITError(hi2c, HAL_I2C_ERROR_SIZE);
    }
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_STOPF) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    /* Call I2C master complete process */
    I2C_ITMasterCplt(hi2c, it_flags);
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt sub-routine which handle the interrupt flags memory mode with DMA.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  it_flags Interrupt flags to handle
  * @param  it_sources Interrupt sources enabled
  * @retval HAL_OK Operation completed successfully
  */
static hal_status_t I2C_Mem_ISR_DMA(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  i2c_start_stop_mode_t direction = I2C_GENERATE_START_WRITE;

  if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_NACKF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_NACKIE) != 0U))
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

    /* No need to generate STOP, it is automatically done */
    /* But enable STOP interrupt, to treat it */
    /* Error callback is send during stop flag treatment */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_CPLT_IT_DMA_MASK);

    I2C_Flush_TXDR(p_i2cx);
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_TXIS) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TXIE) != 0U))
  {
    /* Write LSB part of Memory Address */
    LL_I2C_TransmitData8(p_i2cx, (uint8_t) hi2c->mem_addr);

    /* Reset mem_addr content */
    hi2c->mem_addr = 0xFFFFFFFFU;
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_TCR) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    /* Disable interrupt related to address step */
    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

    /* Enable only Error interrupt */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_ERROR_IT_MASK);

    if (hi2c->xfer_count != 0U)
    {
      /* Prepare the new xfer_size to transfer */
      if (hi2c->xfer_count > MAX_NBYTE_SIZE)
      {
        hi2c->xfer_size = MAX_NBYTE_SIZE;
        I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, I2C_NO_STARTSTOP);
      }
      else
      {
        hi2c->xfer_size = hi2c->xfer_count;
        I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, I2C_NO_STARTSTOP);
      }

      hi2c->xfer_count -= hi2c->xfer_size;

      if (hi2c->global_state == HAL_I2C_STATE_RX)
      {
        LL_I2C_EnableDMAReq_RX(p_i2cx);
      }
      else
      {
        LL_I2C_EnableDMAReq_TX(p_i2cx);
      }
    }
    else
    {
      /* Wrong size status regarding TCR flag event */
      /* Call the corresponding callback to inform upper layer of end of transfer */
      I2C_ITError(hi2c, HAL_I2C_ERROR_SIZE);
    }
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_TC) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_TCIE) != 0U))
  {
    /* Disable interrupt related to address step */
    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

    /* Enable only Error and NACK interrupt for data transfer */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_ERROR_IT_MASK);

    if (hi2c->global_state == HAL_I2C_STATE_RX)
    {
      direction = I2C_GENERATE_START_READ;
    }

    if (hi2c->xfer_count > MAX_NBYTE_SIZE)
    {
      hi2c->xfer_size = MAX_NBYTE_SIZE;

      /* Set NBYTES to write and reload if hi2c->xfer_count > MAX_NBYTE_SIZE and generate RESTART */
      I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_RELOAD, direction);
    }
    else
    {
      hi2c->xfer_size = hi2c->xfer_count;

      /* Set NBYTES to write and generate RESTART */
      I2C_TransferConfig(p_i2cx, (uint32_t)hi2c->dev_addr, hi2c->xfer_size, LL_I2C_MODE_AUTOEND, direction);
    }

    hi2c->xfer_count -= hi2c->xfer_size;

