MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
    if (hi2c->global_state == HAL_I2C_STATE_RX)
    {
      LL_I2C_EnableDMAReq_RX(p_i2cx);
    }
    else
    {
      LL_I2C_EnableDMAReq_TX(p_i2cx);
    }
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_STOPF) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    /* Call I2C master complete process */
    I2C_ITMasterCplt(hi2c, it_flags);
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt sub-routine which handle the interrupt flags slave mode with DMA.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  it_flags Interrupt flags to handle
  * @param  it_sources Interrupt sources enabled
  * @retval HAL_OK Operation completed successfully
  */
static hal_status_t I2C_Slave_ISR_DMA(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t it_sources)
{
  hal_i2c_xfer_opt_t xfer_opt = hi2c->xfer_opt;
  uint32_t treat_dma_nack = 0U;
  hal_i2c_state_t tmp_state;
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Check if STOPF is set */
  if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_STOPF) != 0U)
      && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    /* Call I2C slave complete process */
    I2C_ITSlaveCplt(hi2c, it_flags);
  }

  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_NACKF) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_NACKIE) != 0U))
  {
    /* Check that I2C transfer finished */
    /* if yes, normal use case, a NACK is sent by the MASTER when transfer is finished */
    /* Mean xfer_count == 0 */
    /* So clear flag NACKF only */
    if ((I2C_CHECK_IT_SOURCE(it_sources, I2C_CR1_TXDMAEN) != 0U)
        || (I2C_CHECK_IT_SOURCE(it_sources, I2C_CR1_RXDMAEN) != 0U))
    {
      /* Split check of hdma_rx, for MISRA compliance */
      if (hi2c->hdma_rx != NULL)
      {
        if (I2C_CHECK_IT_SOURCE(it_sources, I2C_CR1_RXDMAEN) != 0U)
        {
          if (HAL_DMA_GetDirectXferRemainingDataByte(hi2c->hdma_rx) == 0U)
          {
            treat_dma_nack = 1U;
          }
        }
      }

      /* Split check of hdma_tx, for MISRA compliance  */
      if (hi2c->hdma_tx != NULL)
      {
        if (I2C_CHECK_IT_SOURCE(it_sources, I2C_CR1_TXDMAEN) != 0U)
        {
          if (HAL_DMA_GetDirectXferRemainingDataByte(hi2c->hdma_tx) == 0U)
          {
            treat_dma_nack = 1U;
          }
        }
      }

      if (treat_dma_nack != 0U)
      {
        if ((hi2c->global_state == HAL_I2C_STATE_LISTEN) && (xfer_opt == HAL_I2C_XFER_FIRST_AND_LAST_FRAME))
          /* Same action must be done for (xfer_opt == HAL_I2C_XFER_LAST_FRAME) which removed for
             Warning[Pa134]: left and right operands are identical */
        {
          /* Call I2C Listen complete process */
          I2C_ITListenCplt(hi2c, it_flags);
        }
        else if ((hi2c->global_state == HAL_I2C_STATE_TX_LISTEN) && (xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION))
        {
          LL_I2C_ClearFlag_NACK(p_i2cx);

          I2C_Flush_TXDR(p_i2cx);

          /* Last byte is transmitted */
          /* Call I2C slave sequential complete process */
          I2C_ITSlaveSeqCplt(hi2c);
        }
        else
        {
          LL_I2C_ClearFlag_NACK(p_i2cx);
        }
      }
      else
      {
        /* if no, error use case, a Non-Acknowledge of last Data is generated by the MASTER */
        LL_I2C_ClearFlag_NACK(p_i2cx);

        /* Set error_code corresponding to a Non-Acknowledge */
        hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

        /* Store current hi2c->global_state, solve MISRA2012-Rule-13.5 */
        tmp_state = hi2c->global_state;

        if ((xfer_opt == HAL_I2C_XFER_FIRST_FRAME) || (xfer_opt == HAL_I2C_XFER_NEXT_FRAME))
        {
          if ((tmp_state == HAL_I2C_STATE_TX) || (tmp_state == HAL_I2C_STATE_TX_LISTEN))
          {
            hi2c->previous_state = I2C_STATE_SLAVE_BUSY_TX;
          }
          else if ((tmp_state == HAL_I2C_STATE_RX) || (tmp_state == HAL_I2C_STATE_RX_LISTEN))
          {
            hi2c->previous_state = I2C_STATE_SLAVE_BUSY_RX;
          }
          else
          {
            /* Do nothing */
          }

          /* Call the corresponding callback to inform upper layer of end of transfer */
          I2C_ITError(hi2c, hi2c->last_error_codes);
        }
      }
    }
    else
    {
      /* Only Clear NACK flag, no DMA treatment is pending */
      LL_I2C_ClearFlag_NACK(p_i2cx);
    }
  }
  else if ((I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_ADDR) != 0U)
           && (I2C_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_ADDRIE) != 0U))
  {
    I2C_ITAddrCplt(hi2c, it_flags);
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}
#endif /* USE_HAL_I2C_DMA */

/**
  * @brief  Master sends target device address followed by internal memory address for write request.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  memory_addr Internal memory address
  * @param  memory_addr_size Size of internal memory address
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK      Operation completed successfully
  * @retval HAL_ERROR   Operation completed with error
  * @retval HAL_TIMEOUT Operation exceeds user timeout
  */
static hal_status_t I2C_RequestMemoryWrite(hal_i2c_handle_t *hi2c, uint32_t device_addr,
                                           uint32_t memory_addr, hal_i2c_mem_addr_size_t memory_addr_size,
                                           uint32_t timeout_ms, uint32_t tick_start)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  hal_status_t hal_status;

  I2C_TransferConfig(p_i2cx, device_addr, (uint32_t)memory_addr_size, LL_I2C_MODE_RELOAD, I2C_GENERATE_START_WRITE);

  hal_status = I2C_WaitOnTXISFlagUntilTimeout(hi2c, timeout_ms, tick_start);
  if (hal_status == HAL_OK)
  {
    /* If memory address size is 8Bit */
    if (memory_addr_size == HAL_I2C_MEM_ADDR_8BIT)
    {
      /* Send Memory Address */
      LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));
    }
    /* If memory address size is 16Bit */
    else
    {
      /* Send MSB of Memory Address */
      LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_MSB(memory_addr));

      hal_status = I2C_WaitOnTXISFlagUntilTimeout(hi2c, timeout_ms, tick_start);
      if (hal_status != HAL_OK)
      {
        return hal_status;
      }

      /* Send LSB of Memory Address */
      LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));
    }

    /* Wait until TCR flag is set */
    hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_TCR, 0U, timeout_ms, tick_start);
  }

  return hal_status;
}

/**
  * @brief  Master sends target device address followed by internal memory address for read request.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  memory_addr Internal memory address
  * @param  memory_addr_size Size of internal memory address
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK      Operation completed successfully
  * @retval HAL_ERROR   Operation completed with error
  * @retval HAL_TIMEOUT Operation exceeds user timeout
  */
static hal_status_t I2C_RequestMemoryRead(hal_i2c_handle_t *hi2c, uint32_t device_addr,
                                          uint32_t memory_addr, hal_i2c_mem_addr_size_t memory_addr_size,
                                          uint32_t timeout_ms, uint32_t tick_start)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  hal_status_t hal_status;

  I2C_TransferConfig(p_i2cx, device_addr, (uint32_t)memory_addr_size, LL_I2C_MODE_SOFTEND, I2C_GENERATE_START_WRITE);

  hal_status = I2C_WaitOnTXISFlagUntilTimeout(hi2c, timeout_ms, tick_start);
  if (hal_status == HAL_OK)
  {
    /* If memory address size is 8Bit */
    if (memory_addr_size == HAL_I2C_MEM_ADDR_8BIT)
    {
      /* Send Memory Address */
      LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));
    }
    /* If memory address size is 16Bit */
    else
    {
      /* Send MSB of Memory Address */
      LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_MSB(memory_addr));

      hal_status = I2C_WaitOnTXISFlagUntilTimeout(hi2c, timeout_ms, tick_start);
      if (hal_status != HAL_OK)
      {
        return hal_status;
      }

      /* Send LSB of Memory Address */
      LL_I2C_TransmitData8(p_i2cx, I2C_MEM_ADD_LSB(memory_addr));
    }

    /* Wait until TC flag is set */
    hal_status = I2C_WaitOnFlagUntilTimeout(hi2c, LL_I2C_ISR_TC, 0U, timeout_ms, tick_start);
  }

  return hal_status;
}

/**
  * @brief  I2C Address complete process callback.
  * @param  hi2c I2C handle
  * @param  it_flags Interrupt flags to handle
  */
static void I2C_ITAddrCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t xfer_direction;
  uint32_t slave_addr_code;
  uint32_t own_addr1_code;
  uint32_t own_addr2_code;

