MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(it_flags);

  /* In case of Listen state, need to inform upper layer of address match code event */
  if (((uint32_t)hi2c->global_state & ((uint32_t)HAL_I2C_STATE_LISTEN | (uint32_t)HAL_I2C_STATE_RX_LISTEN \
                                       | (uint32_t)HAL_I2C_STATE_TX_LISTEN)) != 0U)
  {
    xfer_direction = LL_I2C_GetTransferDirection(p_i2cx);
    slave_addr_code = LL_I2C_GetAddressMatchCode(p_i2cx);
    own_addr1_code = LL_I2C_GetOwnAddress1(p_i2cx);
    own_addr2_code = LL_I2C_GetOwnAddress2(p_i2cx);

    /* If 10bits addressing mode is selected */
    if ((hal_i2c_addressing_mode_t)LL_I2C_GetMasterAddressingMode(p_i2cx) == HAL_I2C_ADDRESSING_10BIT)
    {
      if ((slave_addr_code & SLAVE_ADDR_MSK) == ((own_addr1_code >> SLAVE_ADDR_SHIFT) & SLAVE_ADDR_MSK))
      {
        slave_addr_code = own_addr1_code;
        hi2c->addr_event_count++;
        if (hi2c->addr_event_count == 2U)
        {
          hi2c->addr_event_count = 0U;
          LL_I2C_ClearFlag_ADDR(p_i2cx);

          /* Call slave Addr callback */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
          hi2c->p_slave_addr_cb(hi2c, (hal_i2c_slave_xfer_direction_t)xfer_direction, slave_addr_code);
#else
          HAL_I2C_SLAVE_AddrCallback(hi2c, (hal_i2c_slave_xfer_direction_t)xfer_direction, slave_addr_code);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
      }
      else
      {
        slave_addr_code = own_addr2_code;
        I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT);

        /* Call slave Addr callback */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->p_slave_addr_cb(hi2c, (hal_i2c_slave_xfer_direction_t)xfer_direction, slave_addr_code);
#else
        HAL_I2C_SLAVE_AddrCallback(hi2c, (hal_i2c_slave_xfer_direction_t)xfer_direction, slave_addr_code);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
      }
    }
    /* else 7 bits addressing mode is selected */
    else
    {
      /* Disable ADDR interrupts */
      I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT);

      /* Call slave Addr callback */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->p_slave_addr_cb(hi2c, (hal_i2c_slave_xfer_direction_t)xfer_direction, slave_addr_code);
#else
      HAL_I2C_SLAVE_AddrCallback(hi2c, (hal_i2c_slave_xfer_direction_t)xfer_direction, slave_addr_code);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
  }
  /* Else clear address flag only */
  else
  {
    LL_I2C_ClearFlag_ADDR(p_i2cx);

  }
}

/**
  * @brief  I2C master sequential complete process.
  * @param  hi2c I2C handle
  */
static void I2C_ITMasterSeqCplt(hal_i2c_handle_t *hi2c)
{
  hi2c->mode = HAL_I2C_MODE_NONE;

  /* No Generate Stop, to permit restart mode */
  /* The stop is done at the end of transfer, when LL_I2C_MODE_AUTOEND enable */
  if (hi2c->global_state == HAL_I2C_STATE_TX)
  {
    hi2c->previous_state = I2C_STATE_MASTER_BUSY_TX;
    hi2c->xfer_isr = NULL;
    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_master_tx_cplt_cb(hi2c);
#else
    HAL_I2C_MASTER_TxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
  /* hi2c->global_state == HAL_I2C_STATE_RX */
  else
  {
    hi2c->previous_state = I2C_STATE_MASTER_BUSY_RX;
    hi2c->xfer_isr = NULL;
    I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_master_rx_cplt_cb(hi2c);
#else
    HAL_I2C_MASTER_RxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  I2C slave sequential complete process.
  * @param  hi2c I2C handle
  */
static void I2C_ITSlaveSeqCplt(hal_i2c_handle_t *hi2c)
{
#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t tmp_cr1_value = LL_I2C_READ_REG(p_i2cx, CR1);
#endif /* USE_HAL_I2C_DMA */

  hi2c->mode = HAL_I2C_MODE_NONE;

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
  /* If a DMA is ongoing, Update handle size context */
  if (I2C_CHECK_IT_SOURCE(tmp_cr1_value, I2C_CR1_TXDMAEN) != 0U)
  {
    LL_I2C_DisableDMAReq_TX(p_i2cx);
  }
  else if (I2C_CHECK_IT_SOURCE(tmp_cr1_value, I2C_CR1_RXDMAEN) != 0U)
  {
    LL_I2C_DisableDMAReq_RX(p_i2cx);
  }
  else
  {
    /* Do nothing */
  }
#endif /* USE_HAL_I2C_DMA */

  if (hi2c->global_state == HAL_I2C_STATE_TX_LISTEN)
  {
    /* Remove HAL_I2C_STATE_SLAVE_BUSY_TX, keep only HAL_I2C_STATE_LISTEN */
    hi2c->previous_state = I2C_STATE_SLAVE_BUSY_TX;

    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

    hi2c->global_state = HAL_I2C_STATE_LISTEN;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_slave_tx_cplt_cb(hi2c);
#else
    HAL_I2C_SLAVE_TxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }

  else if (hi2c->global_state == HAL_I2C_STATE_RX_LISTEN)
  {
    /* Remove HAL_I2C_STATE_SLAVE_BUSY_RX, keep only HAL_I2C_STATE_LISTEN */
    hi2c->previous_state = I2C_STATE_SLAVE_BUSY_RX;

    I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

    hi2c->global_state = HAL_I2C_STATE_LISTEN;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_slave_rx_cplt_cb(hi2c);
#else
    HAL_I2C_SLAVE_RxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @brief  I2C master complete process.
  * @param  hi2c I2C handle
  * @param  it_flags Interrupt flags to handle
  */
static void I2C_ITMasterCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t tmp_error;
  uint32_t tmp_it_flags = it_flags;
  volatile uint32_t tmp_reg;

