MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  LL_I2C_ClearFlag_STOP(p_i2cx);

  /* Disable interrupts and store previous state */
  if (hi2c->global_state == HAL_I2C_STATE_TX)
  {
    I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);
    hi2c->previous_state = I2C_STATE_MASTER_BUSY_TX;
  }
  else if (hi2c->global_state == HAL_I2C_STATE_RX)
  {
    I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);
    hi2c->previous_state = I2C_STATE_MASTER_BUSY_RX;
  }
  else
  {
    /* Do nothing */
  }

  I2C_RESET_CR2(p_i2cx);

  /* Reset handle parameters */
  hi2c->xfer_isr = NULL;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;

  if (I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_NACKF) != 0U)
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);
    hi2c->last_error_codes |= HAL_I2C_ERROR_AF;
  }

  /* Fetch last receive data if any */
  if ((hi2c->global_state == HAL_I2C_STATE_ABORT) && (I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_RXNE) != 0U))
  {
    /* Read data from RXDR */
    tmp_reg = LL_I2C_ReceiveData8(p_i2cx);
    STM32_UNUSED(tmp_reg);
  }

  I2C_Flush_TXDR(p_i2cx);
  tmp_error = hi2c->last_error_codes;

  if ((hi2c->global_state == HAL_I2C_STATE_ABORT) || (tmp_error != HAL_I2C_ERROR_NONE))
  {
    /* Call the corresponding callback to inform upper layer of end of transfer */
    I2C_ITError(hi2c, hi2c->last_error_codes);
  }
  /* hi2c->global_state == HAL_I2C_STATE_TX */
  else if (hi2c->global_state == HAL_I2C_STATE_TX)
  {
    hi2c->previous_state = I2C_STATE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    if (hi2c->mode == HAL_I2C_MODE_MASTER_MEM)
    {
      hi2c->mode = HAL_I2C_MODE_NONE;

      /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->p_mem_tx_cplt_cb(hi2c);
#else
      HAL_I2C_MASTER_MemTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
      hi2c->mode = HAL_I2C_MODE_NONE;

      /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->p_master_tx_cplt_cb(hi2c);
#else
      HAL_I2C_MASTER_TxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
  }
  /* hi2c->global_state == HAL_I2C_STATE_RX */
  else if (hi2c->global_state == HAL_I2C_STATE_RX)
  {
    hi2c->previous_state = I2C_STATE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    if (hi2c->mode == HAL_I2C_MODE_MASTER_MEM)
    {
      hi2c->mode = HAL_I2C_MODE_NONE;

      /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->p_mem_rx_cplt_cb(hi2c);
#else
      HAL_I2C_MASTER_MemRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
      hi2c->mode = HAL_I2C_MODE_NONE;

      /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->p_master_rx_cplt_cb(hi2c);
#else
      HAL_I2C_MASTER_RxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @brief  I2C slave complete process.
  * @param  hi2c I2C handle
  * @param  it_flags Interrupt flags to handle
  */
static void I2C_ITSlaveCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t tmp_cr1_value = LL_I2C_READ_REG(p_i2cx, CR1);
  uint32_t tmp_it_flags = it_flags;
  hal_i2c_xfer_opt_t xfer_opt = hi2c->xfer_opt;
  hal_i2c_state_t tmp_state = hi2c->global_state;

  LL_I2C_ClearFlag_STOP(p_i2cx);

  /* Disable interrupts and store previous state */
  if ((tmp_state == HAL_I2C_STATE_TX) || (tmp_state == HAL_I2C_STATE_TX_LISTEN)
      || (tmp_state == HAL_I2C_STATE_LISTEN))
  {
    I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_TX_IT);
    hi2c->previous_state = I2C_STATE_SLAVE_BUSY_TX;
  }
  else if ((tmp_state == HAL_I2C_STATE_RX) || (tmp_state == HAL_I2C_STATE_RX_LISTEN))
  {
    I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_RX_IT);
    hi2c->previous_state = I2C_STATE_SLAVE_BUSY_RX;
  }
  else
  {
    /* Do nothing */
  }

  I2C_RESET_CR2(p_i2cx);

  I2C_Flush_TXDR(p_i2cx);

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
  /* If a DMA is ongoing, Update handle size context */
  if (I2C_CHECK_IT_SOURCE(tmp_cr1_value, I2C_CR1_TXDMAEN) != 0U)
  {
    LL_I2C_DisableDMAReq_TX(p_i2cx);

    if (hi2c->hdma_tx != NULL)
    {
      hi2c->xfer_count = (uint32_t)HAL_DMA_GetDirectXferRemainingDataByte(hi2c->hdma_tx);
    }
  }
  else if (I2C_CHECK_IT_SOURCE(tmp_cr1_value, I2C_CR1_RXDMAEN) != 0U)
  {
    LL_I2C_DisableDMAReq_RX(p_i2cx);

    if (hi2c->hdma_rx != NULL)
    {
      hi2c->xfer_count = (uint32_t)HAL_DMA_GetDirectXferRemainingDataByte(hi2c->hdma_rx);
    }
  }
  else
  {
    /* Do nothing */
  }
#endif /* USE_HAL_I2C_DMA */

  /* Store last receive data if any */
  if (I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_RXNE) != 0U)
  {
    /* Remove RXNE flag on temporary variable as read done */
    tmp_it_flags &= ~LL_I2C_ISR_RXNE;

    /* Read data from RXDR */
    *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
    hi2c->p_buf_rx++;
    if ((hi2c->xfer_size > 0U))
    {
      hi2c->xfer_size--;
      hi2c->xfer_count--;
    }
  }

  /* All data are not transferred, so set error code accordingly */
  if (hi2c->xfer_count != 0U)
  {
    /* Set error_code corresponding to a Non-Acknowledge */
    hi2c->last_error_codes |= HAL_I2C_ERROR_AF;
  }

  if ((I2C_CHECK_FLAG(tmp_it_flags, LL_I2C_ISR_NACKF) != 0U)
      && (I2C_CHECK_IT_SOURCE(tmp_cr1_value, LL_I2C_CR1_NACKIE) != 0U))
  {
    /* Check that I2C transfer finished */
    /* if yes, normal use case, a NACK is sent by the MASTER when Transfer is finished */
    /* Mean xfer_count == 0*/
    /* So clear Flag NACKF only */
    if (hi2c->xfer_count == 0U)
    {
      if ((hi2c->global_state == HAL_I2C_STATE_LISTEN) && (xfer_opt == HAL_I2C_XFER_FIRST_AND_LAST_FRAME))
        /* Same action must be done for (xfer_opt == I2C_LAST_FRAME) which removed for
           Warning[Pa134]: left and right operands are identical */
      {
        /* Call I2C Listen complete process */
        I2C_ITListenCplt(hi2c, tmp_it_flags);
      }
      else if ((hi2c->global_state == HAL_I2C_STATE_TX_LISTEN) && (xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION))
      {
        /* Clear NACK Flag */
        LL_I2C_ClearFlag_NACK(p_i2cx);

        /* Flush TX register */
        I2C_Flush_TXDR(p_i2cx);

        /* Last Byte is Transmitted */
        /* Call I2C Slave Sequential complete process */
        I2C_ITSlaveSeqCplt(hi2c);
      }
      else
      {
        /* Clear NACK Flag */
        LL_I2C_ClearFlag_NACK(p_i2cx);
      }
    }
    else
    {
      /* if no, error use case, a Non-Acknowledge of last Data is generated by the MASTER*/
      /* Clear NACK Flag */
      LL_I2C_ClearFlag_NACK(p_i2cx);

      /* Set last_error_codes corresponding to a Non-Acknowledge */
      hi2c->last_error_codes |= HAL_I2C_ERROR_AF;

