MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
      if ((xfer_opt == HAL_I2C_XFER_FIRST_FRAME) || (xfer_opt == HAL_I2C_XFER_NEXT_FRAME))
      {
        /* Call the corresponding callback to inform upper layer of End of Transfer */
        I2C_ITError(hi2c, hi2c->last_error_codes);
      }
    }
  }

  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->xfer_isr = NULL;

  if (hi2c->last_error_codes != HAL_I2C_ERROR_NONE)
  {
    /* Call the corresponding callback to inform upper layer of end of transfer */
    I2C_ITError(hi2c, hi2c->last_error_codes);

    /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
    if (hi2c->global_state == HAL_I2C_STATE_LISTEN)
    {
      /* Call I2C Listen complete process */
      I2C_ITListenCplt(hi2c, tmp_it_flags);
    }
  }
  else if (hi2c->xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION)
  {
    /* Call the Sequential Complete callback, to inform upper layer of the end of transfer */
    I2C_ITSlaveSeqCplt(hi2c);

    hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
    hi2c->previous_state = I2C_STATE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_slave_listen_cplt_cb(hi2c);
#else
    HAL_I2C_SLAVE_ListenCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
  /* Call the corresponding callback to inform upper layer of end of transfer */
  else if (hi2c->global_state == HAL_I2C_STATE_RX)
  {
    hi2c->previous_state = I2C_STATE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_slave_rx_cplt_cb(hi2c);
#else
    HAL_I2C_SLAVE_RxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
  else
  {
    hi2c->previous_state = I2C_STATE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_slave_tx_cplt_cb(hi2c);
#else
    HAL_I2C_SLAVE_TxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  I2C Listen complete process.
  * @param  hi2c I2C handle
  * @param  it_flags Interrupt flags to handle
  */
static void I2C_ITListenCplt(hal_i2c_handle_t *hi2c, uint32_t it_flags)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);

  /* Reset handle parameters */
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->previous_state = I2C_STATE_NONE;
  hi2c->xfer_isr = NULL;

  /* Store last receive data if any */
  if (I2C_CHECK_FLAG(it_flags, LL_I2C_ISR_RXNE) != 0U)
  {
    /* Read data from RXDR */
    *hi2c->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);
    hi2c->p_buf_rx++;
    if ((hi2c->xfer_size > 0U))
    {
      hi2c->xfer_size--;
      hi2c->xfer_count--;

      /* Set error_code corresponding to a Non-Acknowledge */
      hi2c->last_error_codes |= HAL_I2C_ERROR_AF;
    }
  }

  /* Disable all interrupts */
  I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_RX_IT | I2C_XFER_TX_IT);

  LL_I2C_ClearFlag_NACK(p_i2cx);

  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->global_state = HAL_I2C_STATE_IDLE;

  /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
  hi2c->p_slave_listen_cplt_cb(hi2c);
#else
  HAL_I2C_SLAVE_ListenCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
}

/**
  * @brief  I2C interrupts error process.
  * @param  hi2c I2C handle
  * @param  error_code Error code to handle
  */
static void I2C_ITError(hal_i2c_handle_t *hi2c, uint32_t error_code)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
  uint32_t tmppreviousstate;
#endif /* USE_HAL_I2C_DMA */
  hal_i2c_state_t tmp_state = hi2c->global_state;

  /* Reset handle parameters */
  hi2c->mode = HAL_I2C_MODE_NONE;
  hi2c->xfer_opt = (hal_i2c_xfer_opt_t) XFER_NO_OPTION;
  hi2c->xfer_count = 0U;

  /* Set new error code */
  hi2c->last_error_codes |= error_code;

  /* Disable interrupts */
  if (((uint32_t)tmp_state & ((uint32_t)HAL_I2C_STATE_LISTEN | (uint32_t)HAL_I2C_STATE_RX_LISTEN \
                              | (uint32_t)HAL_I2C_STATE_TX_LISTEN)) != 0U)
  {
    /* Disable all interrupts, except interrupts related to LISTEN state */
    I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT | I2C_XFER_TX_IT);

    /* keep HAL_I2C_STATE_LISTEN if set */
    hi2c->global_state = HAL_I2C_STATE_LISTEN;
    hi2c->xfer_isr = I2C_Slave_ISR_IT;
  }
  else
  {
    /* Disable all interrupts */
    I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_RX_IT | I2C_XFER_TX_IT);

    I2C_Flush_TXDR(p_i2cx);

    /* If state is an abort treatment ongoing, do not change state */
    /* This change is done later */
    if (hi2c->global_state != HAL_I2C_STATE_ABORT)
    {
      /* Set HAL_I2C_STATE_IDLE */
      hi2c->global_state = HAL_I2C_STATE_IDLE;
    }

    /* Check if a STOPF is detected */
    if (LL_I2C_IsActiveFlag_STOP(p_i2cx) != 0U)
    {
      if (LL_I2C_IsActiveFlag_NACK(p_i2cx) != 0U)
      {
        LL_I2C_ClearFlag_NACK(p_i2cx);
        hi2c->last_error_codes |= HAL_I2C_ERROR_AF;
      }

      LL_I2C_ClearFlag_STOP(p_i2cx);
    }

    hi2c->xfer_isr = NULL;
  }

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
  /* Abort DMA TX transfer if any */
  tmppreviousstate = hi2c->previous_state;
  if ((hi2c->hdma_tx != NULL) && ((tmppreviousstate == I2C_STATE_MASTER_BUSY_TX)
                                  || (tmppreviousstate == I2C_STATE_SLAVE_BUSY_TX)))
  {
    if (LL_I2C_IsEnabledDMAReq_TX(p_i2cx) != 0UL)
    {
      LL_I2C_DisableDMAReq_TX(p_i2cx);
    }

    if (HAL_DMA_GetState(hi2c->hdma_tx) != HAL_DMA_STATE_IDLE)
    {
      /* Set the I2C DMA abort callback with HAL_I2C_ErrorCallback() at end of DMA abort procedure */
      hi2c->hdma_tx->p_xfer_abort_cb = I2C_DMAAbort;

