MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
      /* Abort DMA TX */
      if (HAL_DMA_Abort_IT(hi2c->hdma_tx) != HAL_OK)
      {
        /* Call directly p_xfer_abort_cb function in case of error */
        hi2c->hdma_tx->p_xfer_abort_cb(hi2c->hdma_tx);
      }
    }
    else
    {
      I2C_TreatErrorCallback(hi2c);
    }
  }
  /* Abort DMA RX transfer if any */
  else if ((hi2c->hdma_rx != NULL) && ((tmppreviousstate == I2C_STATE_MASTER_BUSY_RX)
                                       || (tmppreviousstate == I2C_STATE_SLAVE_BUSY_RX)))
  {
    if (LL_I2C_IsEnabledDMAReq_RX(p_i2cx) != 0UL)
    {
      LL_I2C_DisableDMAReq_RX(p_i2cx);
    }

    if (HAL_DMA_GetState(hi2c->hdma_rx) != HAL_DMA_STATE_IDLE)
    {
      /* Set the I2C DMA abort callback with HAL_I2C_ErrorCallback() at end of DMA abort procedure */
      hi2c->hdma_rx->p_xfer_abort_cb = I2C_DMAAbort;

      /* Abort DMA RX */
      if (HAL_DMA_Abort_IT(hi2c->hdma_rx) != HAL_OK)
      {
        /* Call directly hi2c->hdma_rx->p_xfer_abort_cb function in case of error */
        hi2c->hdma_rx->p_xfer_abort_cb(hi2c->hdma_rx);
      }
    }
    else
    {
      I2C_TreatErrorCallback(hi2c);
    }
  }
  else
#endif /* USE_HAL_I2C_DMA */
  {
    I2C_TreatErrorCallback(hi2c);
  }
}

/**
  * @brief  I2C Error callback treatment.
  * @param  hi2c I2C handle
  */
static void I2C_TreatErrorCallback(hal_i2c_handle_t *hi2c)
{
  if (hi2c->global_state == HAL_I2C_STATE_ABORT)
  {
    hi2c->previous_state = I2C_STATE_NONE;
    hi2c->global_state = HAL_I2C_STATE_IDLE;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_abort_cplt_cb(hi2c);
#else
    HAL_I2C_AbortCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
  else
  {
    hi2c->previous_state = I2C_STATE_NONE;

    /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->p_error_cb(hi2c);
#else
    HAL_I2C_ErrorCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  I2C Tx data register flush process.
  * @param  p_i2cx CMSIS handle
  */
static void I2C_Flush_TXDR(I2C_TypeDef *p_i2cx)
{
  /* If a pending TXIS flag is set */
  /* Write a dummy data in TXDR to clear it */
  if (LL_I2C_IsActiveFlag_TXIS(p_i2cx) != 0U)
  {
    LL_I2C_TransmitData8(p_i2cx, 0x00U);
  }

  if (LL_I2C_IsActiveFlag_TXE(p_i2cx) == 0U)
  {
    LL_I2C_ClearFlag_TXE(p_i2cx);
  }
}

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/**
  * @brief  DMA I2C master transmit process complete callback.
  * @param  hdma DMA handle
  */
static void I2C_DMAMasterTransmitCplt(hal_dma_handle_t *hdma)
{
  hal_i2c_handle_t *hi2c = (hal_i2c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_DisableDMAReq_TX(p_i2cx);

  /* If last transfer, enable STOP interrupt */
  if (hi2c->xfer_count == 0U)
  {
    /* Enable STOP interrupt */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_CPLT_IT_DMA_MASK);
  }
  /* else prepare a new DMA transfer and enable TCReload interrupt */
  else
  {
    hi2c->p_buf_tx += hi2c->xfer_size;
    if (hi2c->xfer_count > MAX_NBYTE_SIZE)
    {
      hi2c->xfer_size = MAX_NBYTE_SIZE;
    }
    else
    {
      hi2c->xfer_size = hi2c->xfer_count;
    }

    /* Enable the DMA channel */
    if (HAL_DMA_StartPeriphXfer_IT_Opt(hi2c->hdma_tx,
                                       (uint32_t)hi2c->p_buf_tx,
                                       LL_I2C_DMA_GetRegAddrTx(p_i2cx),
                                       hi2c->xfer_size, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      /* Call the corresponding callback to inform upper layer of end of transfer */
      I2C_ITError(hi2c, HAL_I2C_ERROR_DMA);
    }
    else
    {
      /* Enable TC interrupts */
      LL_I2C_EnableIT(p_i2cx, I2C_XFER_RELOAD_IT_MASK);
    }
  }
}

/**
  * @brief  DMA I2C slave transmit process complete callback.
  * @param  hdma DMA handle
  */
static void I2C_DMASlaveTransmitCplt(hal_dma_handle_t *hdma)
{
  hal_i2c_handle_t *hi2c = (hal_i2c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  hal_i2c_xfer_opt_t xfer_opt = hi2c->xfer_opt;
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);

  if ((xfer_opt == HAL_I2C_XFER_NEXT_FRAME) || (xfer_opt == HAL_I2C_XFER_FIRST_FRAME))
  {
    LL_I2C_DisableDMAReq_TX(p_i2cx);

    /* Last byte is transmitted */
    /* Call I2C slave sequential complete process */
    I2C_ITSlaveSeqCplt(hi2c);
  }
  else
  {
    /* No specific action, master fully manage the generation of STOP condition */
    /* Mean that this generation can arrive at any time, at the end or during DMA process */
    /* So STOP condition must be managed through interrupt treatment */
  }
}

/**
  * @brief  DMA I2C master receive process complete callback.
  * @param  hdma DMA handle
  */
static void I2C_DMAMasterReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_i2c_handle_t *hi2c = (hal_i2c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);

  LL_I2C_DisableDMAReq_RX(p_i2cx);

  /* If last transfer, enable STOP interrupt */
  if (hi2c->xfer_count == 0U)
  {
    /* Enable STOP interrupt */
    LL_I2C_EnableIT(p_i2cx, I2C_XFER_CPLT_IT_DMA_MASK);
  }
  /* else prepare a new DMA transfer and enable TCReload interrupt */
  else
  {
    hi2c->p_buf_rx += hi2c->xfer_size;
    if (hi2c->xfer_count > MAX_NBYTE_SIZE)
    {
      hi2c->xfer_size = MAX_NBYTE_SIZE;
    }
    else
    {
      hi2c->xfer_size = hi2c->xfer_count;
    }

    /* Enable the DMA channel */
    if (HAL_DMA_StartPeriphXfer_IT_Opt(hi2c->hdma_rx,
                                       LL_I2C_DMA_GetRegAddrRx(p_i2cx),
                                       (uint32_t)hi2c->p_buf_rx,
                                       hi2c->xfer_size, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      /* Call the corresponding callback to inform upper layer of end of transfer */
      I2C_ITError(hi2c, HAL_I2C_ERROR_DMA);
    }
    else
    {
      /* Enable TC interrupts */
      LL_I2C_EnableIT(p_i2cx, I2C_XFER_RELOAD_IT_MASK);
    }
  }
}

/**
  * @brief  DMA I2C slave receive process complete callback.
  * @param  hdma DMA handle
  */
static void I2C_DMASlaveReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_i2c_handle_t *hi2c = (hal_i2c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  hal_i2c_xfer_opt_t xfer_opt = hi2c->xfer_opt;

  if ((HAL_DMA_GetDirectXferRemainingDataByte(hi2c->hdma_rx) == 0U)
      && (xfer_opt != (hal_i2c_xfer_opt_t) XFER_NO_OPTION))
  {
    LL_I2C_DisableDMAReq_RX(p_i2cx);

    /* Call I2C slave sequential complete process */
    I2C_ITSlaveSeqCplt(hi2c);
  }
  else
  {
    /* No specific action, master fully manage the generation of STOP condition */
    /* Mean that this generation can arrive at any time, at the end or during DMA process */
    /* So STOP condition must be managed through interrupt treatment */
  }
}

/**
  * @brief  DMA I2C communication error callback.
  * @param hdma DMA handle
  */
static void I2C_DMAError(hal_dma_handle_t *hdma)
{
  hal_i2c_handle_t *hi2c = (hal_i2c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

  /* Call the corresponding callback to inform upper layer of end of transfer */
  I2C_ITError(hi2c, HAL_I2C_ERROR_DMA);
}

/**
  * @brief  DMA I2C communication abort callback.
  *         (To be called at end of DMA abort procedure).
  * @param  hdma DMA handle.
  */
static void I2C_DMAAbort(hal_dma_handle_t *hdma)
{
  hal_i2c_handle_t *hi2c = (hal_i2c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

  I2C_TreatErrorCallback(hi2c);
}
#endif /* USE_HAL_I2C_DMA */

/**
  * @brief  This function handles I2C Communication timeout.
  *         It waits until a flag is no longer in the specified status.
  * @param  hi2c Pointer to a I2C_TypeDef
  * @param  flag Specifies the I2C flag to check
  * @param  status The actual flag status (SET or RESET)
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK      Operation completed successfully
  * @retval HAL_ERROR   Operation completed with error
  * @retval HAL_TIMEOUT Operation exceeds user timeout
  */
static hal_status_t I2C_WaitOnFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t flag, uint32_t status,
                                               uint32_t timeout_ms, uint32_t tick_start)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t it_flags = LL_I2C_READ_REG(p_i2cx, ISR);
  while (LL_I2C_IsActiveFlag(p_i2cx, flag) == status)
  {
    /* Check if an error is detected */
    if (I2C_IsErrorOccurred(hi2c, it_flags, timeout_ms, tick_start) != HAL_OK)
    {
      return HAL_ERROR;
    }

