MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        if ((LL_I2C_IsActiveFlag(p_i2cx, flag) == status))
        {
          return HAL_TIMEOUT;
        }
      }
    }
    it_flags = LL_I2C_READ_REG(p_i2cx, ISR);
  }
  return HAL_OK;
}

/**
  * @brief  This function handles I2C Communication timeout for specific usage of TXIS flag.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK      Operation completed successfully
  * @retval HAL_ERROR   Operation completed with error
  * @retval HAL_TIMEOUT Operation exceeds user timeout
  */
static hal_status_t I2C_WaitOnTXISFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t timeout_ms, uint32_t tick_start)
{
  hal_status_t hal_status;
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t it_flags = LL_I2C_READ_REG(p_i2cx, ISR);

  while (LL_I2C_IsActiveFlag_TXIS(p_i2cx) == 0U)
  {
    /* Check if an error is detected */
    hal_status = I2C_IsErrorOccurred(hi2c, it_flags, timeout_ms, tick_start);
    if (hal_status != HAL_OK)
    {
      return hal_status;
    }

    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        if (LL_I2C_IsActiveFlag_TXIS(p_i2cx) == 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    it_flags = LL_I2C_READ_REG(p_i2cx, ISR);
  }
  return HAL_OK;
}

/**
  * @brief  This function handles I2C Communication timeout for specific usage of STOP flag.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK      Operation completed successfully
  * @retval HAL_ERROR   Operation completed with error
  * @retval HAL_TIMEOUT Operation exceeds user timeout
  */
static hal_status_t I2C_WaitOnSTOPFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t timeout_ms, uint32_t tick_start)
{
  hal_status_t hal_status;
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t it_flags = LL_I2C_READ_REG(p_i2cx, ISR);

  while (LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U)
  {
    /* Check if an error is detected */
    hal_status = I2C_IsErrorOccurred(hi2c, it_flags, timeout_ms, tick_start);
    if (hal_status != HAL_OK)
    {
      return hal_status;
    }

    /* Check for the timeout */
    if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
    {
      if (LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U)
      {
        return HAL_TIMEOUT;
      }
    }
    it_flags = LL_I2C_READ_REG(p_i2cx, ISR);
  }
  return HAL_OK;
}

/**
  * @brief  This function handles I2C Communication timeout for specific usage of RXNE flag.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK      Operation completed successfully
  * @retval HAL_ERROR   Operation completed with error
  * @retval HAL_TIMEOUT Operation exceeds user timeout
  */
static hal_status_t I2C_WaitOnRXNEFlagUntilTimeout(hal_i2c_handle_t *hi2c, uint32_t timeout_ms, uint32_t tick_start)
{
  hal_status_t hal_status;
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  uint32_t it_flags = LL_I2C_READ_REG(p_i2cx, ISR);

  while (LL_I2C_IsActiveFlag_RXNE(p_i2cx) == 0U)
  {
    /* Check if an error is detected */
    hal_status = I2C_IsErrorOccurred(hi2c, it_flags, timeout_ms, tick_start);
    if (hal_status != HAL_OK)
    {
      return hal_status;
    }

    /* Check if a STOPF is detected */
    if (LL_I2C_IsActiveFlag_STOP(p_i2cx) != 0U)
    {
      /* Check if an RXNE is pending */
      /* Store last receive data if any */
      if ((LL_I2C_IsActiveFlag_RXNE(p_i2cx) != 0U) && (hi2c->xfer_size > 0U))
      {
        /* The Reading of data from RXDR is done in caller function */
        return HAL_OK;
      }
      else
      {
        if (LL_I2C_IsActiveFlag_NACK(p_i2cx) != 0U)
        {
          LL_I2C_ClearFlag_NACK(p_i2cx);
          hi2c->last_error_codes = HAL_I2C_ERROR_AF;
        }

        LL_I2C_ClearFlag_STOP(p_i2cx);
        I2C_RESET_CR2(p_i2cx);
        return HAL_ERROR;
      }
    }

    /* Check for the timeout */
    if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
    {
      if (LL_I2C_IsActiveFlag_RXNE(p_i2cx) == 0U)
      {
        return HAL_TIMEOUT;
      }
    }
    it_flags = LL_I2C_READ_REG(p_i2cx, ISR);
  } /* End of while */

  return HAL_OK;
}

/**
  * @brief  This function handles errors detection during an I2C Communication.
  * @param  hi2c Pointer to a hal_i2c_handle_t
  * @param  it_flags flag register before function call
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK     Operation completed successfully
  * @retval HAL_ERROR  Operation completed with error
  */
static hal_status_t I2C_IsErrorOccurred(hal_i2c_handle_t *hi2c, uint32_t it_flags, uint32_t timeout_ms,
                                        uint32_t tick_start)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);
  hal_status_t status = HAL_OK;
  uint32_t error_codes = 0;
  uint32_t tick_start_local = tick_start;
  uint32_t tmp_register;
  uint32_t tmp_it_flags = it_flags;
  hal_i2c_mode_t tmp_mode;

  if (STM32_IS_BIT_SET(tmp_it_flags, LL_I2C_ISR_NACKF))
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    /* Wait until STOP flag is set or timeout occurred */
    /* AutoEnd must be initiated after AF */
    while ((LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U) && (status == HAL_OK))
    {
      /* Check for the timeout */
      if (timeout_ms != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tick_start_local) > timeout_ms) || (timeout_ms == 0U))
        {
          tmp_register = (uint32_t)(LL_I2C_READ_REG(p_i2cx, CR2) & I2C_CR2_STOP);
          tmp_mode = hi2c->mode;

          /* In case of I2C still busy, try to regenerate a STOP manually */
          if ((LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
              && (tmp_register != I2C_CR2_STOP)
              && (tmp_mode != HAL_I2C_MODE_SLAVE))
          {
            LL_I2C_GenerateStopCondition(p_i2cx);

            /* Update Tick with new reference */
            tick_start_local = HAL_GetTick();
          }

          while (LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U)
          {
            /* Check for the timeout */
            if ((HAL_GetTick() - tick_start_local) > I2C_DEFAULT_TIMEOUT_MS)
            {
              status = HAL_ERROR;
              break;
            }
          }
        }
      }
    }

    /* In case STOP flag is detected, clear it */
    if (status == HAL_OK)
    {
      LL_I2C_ClearFlag_STOP(p_i2cx);
    }

    error_codes |= HAL_I2C_ERROR_AF;
    status = HAL_ERROR;
  }

  /* Refresh Content of status register */
  tmp_it_flags = LL_I2C_READ_REG(p_i2cx, ISR);

  /* Verify if additional errors occur */
  /* Check if a Bus error occurred */
  if (STM32_IS_BIT_SET(tmp_it_flags, LL_I2C_ISR_BERR))
  {
    error_codes |= HAL_I2C_ERROR_BERR;

    LL_I2C_ClearFlag_BERR(p_i2cx);
    status = HAL_ERROR;
  }

  /* Check if an Over-Run/Under-Run error occurred */
  if (STM32_IS_BIT_SET(tmp_it_flags, LL_I2C_ISR_OVR))
  {
    error_codes |= HAL_I2C_ERROR_OVR;

    LL_I2C_ClearFlag_OVR(p_i2cx);
    status = HAL_ERROR;
  }

  /* Check if an arbitration loss error occurred */
  if (STM32_IS_BIT_SET(tmp_it_flags, LL_I2C_ISR_ARLO))
  {
    error_codes |= HAL_I2C_ERROR_ARLO;

    LL_I2C_ClearFlag_ARLO(p_i2cx);
    status = HAL_ERROR;
  }

  if (status != HAL_OK)
  {
    I2C_Flush_TXDR(p_i2cx);
    I2C_RESET_CR2(p_i2cx);

    hi2c->last_error_codes |= error_codes;
  }

