MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.c
  return status;
}

/**
  * @brief  Handle I2Cx communication when starting transfer or during transfer (TC or TCR flag are set).
  * @param  p_i2cx Pointer to a I2C_TypeDef
  * @param  device_addr Specifies the slave address to be programmed
  * @param  size_byte Specifies the number of bytes to be programmed. It must be a value between 0 and 255.
  * @param  mode New state of the I2C START condition generation :
  *           Enable Reload mode
  *           Automatic end mode
  *           Enable Software end mode
  * @param  request New state of the I2C START condition generation :
  *           Don't Generate stop and start condition
  *           Generate stop condition (size_byte must be set to 0)
  *           Generate Restart for read request
  *           Generate Restart for write request
  */
static void I2C_TransferConfig(I2C_TypeDef *p_i2cx, uint32_t device_addr, uint32_t size_byte, uint32_t mode,
                               i2c_start_stop_mode_t request)
{
  ASSERT_DBG_PARAM(IS_TRANSFER_MODE(mode));
  ASSERT_DBG_PARAM(IS_TRANSFER_REQUEST(request));

  /* Declaration of tmp to prevent undefined behavior of volatile usage */
  uint32_t tmp = ((uint32_t)(((uint32_t)device_addr & I2C_CR2_SADD)
                             | (((uint32_t)size_byte << I2C_CR2_NBYTES_Pos) & I2C_CR2_NBYTES)
                             | (uint32_t)mode | (uint32_t)request) & (~0x80000000U));

  STM32_MODIFY_REG(p_i2cx->CR2,
                   ((I2C_CR2_SADD | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_AUTOEND
                     | (I2C_CR2_RD_WRN & ((uint32_t) request >> (31U - I2C_CR2_RD_WRN_Pos)))
                     | I2C_CR2_START | I2C_CR2_STOP)), tmp);
}

/**
  * @brief  Manage the disabling of interrupts.
  * @param  hi2c Pointer to a hal_i2c_handle_t that contains the configuration information for the specified I2C
  * @param  it_request Value of @ref I2C_Interrupt_configuration.
  */
static void I2C_Disable_IRQ(hal_i2c_handle_t *hi2c, uint32_t it_request)
{
  uint32_t tmp_isr = 0U;
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hi2c);

  if ((it_request & I2C_XFER_TX_IT) == I2C_XFER_TX_IT)
  {
    /* Disable TC and TXI interrupts */
    tmp_isr |= LL_I2C_CR1_TCIE | LL_I2C_CR1_TXIE;

    if (((uint32_t)hi2c->global_state & ((uint32_t)HAL_I2C_STATE_LISTEN | (uint32_t)HAL_I2C_STATE_RX_LISTEN \
                                         | (uint32_t)HAL_I2C_STATE_TX_LISTEN)) == 0U)
    {
      /* Disable NACK and STOP interrupts */
      tmp_isr |= LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE | LL_I2C_CR1_ERRIE;
    }
  }

  if ((it_request & I2C_XFER_RX_IT) == I2C_XFER_RX_IT)
  {
    /* Disable TC and RXI interrupts */
    tmp_isr |= LL_I2C_CR1_TCIE | LL_I2C_CR1_RXIE;

    if (((uint32_t)hi2c->global_state & ((uint32_t)HAL_I2C_STATE_LISTEN | (uint32_t)HAL_I2C_STATE_RX_LISTEN \
                                         | (uint32_t)HAL_I2C_STATE_TX_LISTEN)) == 0U)
    {
      /* Disable NACK and STOP interrupts */
      tmp_isr |= LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE | LL_I2C_CR1_ERRIE;
    }
  }

  if ((it_request & I2C_XFER_LISTEN_IT) == I2C_XFER_LISTEN_IT)
  {
    /* Disable ADDR, NACK and STOP interrupts */
    tmp_isr |= I2C_XFER_LISTEN_IT_MASK;
  }

  /* Disable interrupts only at the end to avoid a breaking situation */
  /* like at "t" time all disable interrupts request are not done */
  LL_I2C_DisableIT(p_i2cx, tmp_isr);
}

/**
  * @brief  Convert I2Cx OTHER_xxx xfer_opt to functional xfer_opt.
  * @param  hi2c I2C handle
  */
static void I2C_ConvertOtherXferOptions(hal_i2c_handle_t *hi2c)
{
  /* if user set xfer_opt to HAL_I2C_XFER_OTHER_FRAME */
  /* it request implicitly to generate a restart condition */
  /* set xfer_opt to HAL_I2C_XFER_FIRST_FRAME */
  if (hi2c->xfer_opt == HAL_I2C_XFER_OTHER_FRAME)
  {
    hi2c->xfer_opt = HAL_I2C_XFER_FIRST_FRAME;
  }
  /* else if user set xfer_opt to HAL_I2C_XFER_OTHER_AND_LAST_FRAME */
  /* it request implicitly to generate a restart condition */
  /* then generate a stop condition at the end of transfer */
  /* set xfer_opt to HAL_I2C_XFER_FIRST_AND_LAST_FRAME */
  else if (hi2c->xfer_opt == HAL_I2C_XFER_OTHER_AND_LAST_FRAME)
  {
    hi2c->xfer_opt = HAL_I2C_XFER_FIRST_AND_LAST_FRAME;
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_I2C_MODULE */
#endif /* I2C1 || I2C2 */

/**
  * @}
  */
